======================================================================================================================================================
Layer (type:depth-idx)                             Input Shape               Output Shape              Param #                   Mult-Adds
======================================================================================================================================================
MobileNetV2                                        [128, 3, 224, 224]        [128, 1000]               --                        --
├─Sequential: 1-1                                  [128, 3, 224, 224]        [128, 1280, 7, 7]         --                        --
│    └─Conv2dNormActivation: 2-1                   [128, 3, 224, 224]        [128, 32, 112, 112]       --                        --
│    │    └─Conv2d: 3-1                            [128, 3, 224, 224]        [128, 32, 112, 112]       864                       1,387,266,048
│    │    └─BatchNorm2d: 3-2                       [128, 32, 112, 112]       [128, 32, 112, 112]       64                        8,192
│    │    └─ReLU6: 3-3                             [128, 32, 112, 112]       [128, 32, 112, 112]       --                        --
│    └─InvertedResidual: 2-2                       [128, 32, 112, 112]       [128, 16, 112, 112]       --                        --
│    │    └─Sequential: 3-4                        [128, 32, 112, 112]       [128, 16, 112, 112]       896                       1,284,517,888
│    └─InvertedResidual: 2-3                       [128, 16, 112, 112]       [128, 24, 56, 56]         --                        --
│    │    └─Sequential: 3-5                        [128, 16, 112, 112]       [128, 24, 56, 56]         5,136                     3,737,966,592
│    └─InvertedResidual: 2-4                       [128, 24, 56, 56]         [128, 24, 56, 56]         --                        --
│    │    └─Sequential: 3-6                        [128, 24, 56, 56]         [128, 24, 56, 56]         8,832                     3,294,836,736
│    └─InvertedResidual: 2-5                       [128, 24, 56, 56]         [128, 32, 28, 28]         --                        --
│    │    └─Sequential: 3-7                        [128, 24, 56, 56]         [128, 32, 28, 28]         10,000                    1,979,826,176
│    └─InvertedResidual: 2-6                       [128, 32, 28, 28]         [128, 32, 28, 28]         --                        --
│    │    └─Sequential: 3-8                        [128, 32, 28, 28]         [128, 32, 28, 28]         14,848                    1,406,640,128
│    └─InvertedResidual: 2-7                       [128, 32, 28, 28]         [128, 32, 28, 28]         --                        --
│    │    └─Sequential: 3-9                        [128, 32, 28, 28]         [128, 32, 28, 28]         14,848                    1,406,640,128
│    └─InvertedResidual: 2-8                       [128, 32, 28, 28]         [128, 64, 14, 14]         --                        --
│    │    └─Sequential: 3-10                       [128, 32, 28, 28]         [128, 64, 14, 14]         21,056                    968,310,784
│    └─InvertedResidual: 2-9                       [128, 64, 14, 14]         [128, 64, 14, 14]         --                        --
│    │    └─Sequential: 3-11                       [128, 64, 14, 14]         [128, 64, 14, 14]         54,272                    1,320,042,496
│    └─InvertedResidual: 2-10                      [128, 64, 14, 14]         [128, 64, 14, 14]         --                        --
│    │    └─Sequential: 3-12                       [128, 64, 14, 14]         [128, 64, 14, 14]         54,272                    1,320,042,496
│    └─InvertedResidual: 2-11                      [128, 64, 14, 14]         [128, 64, 14, 14]         --                        --
│    │    └─Sequential: 3-13                       [128, 64, 14, 14]         [128, 64, 14, 14]         54,272                    1,320,042,496
│    └─InvertedResidual: 2-12                      [128, 64, 14, 14]         [128, 96, 14, 14]         --                        --
│    │    └─Sequential: 3-14                       [128, 64, 14, 14]         [128, 96, 14, 14]         66,624                    1,628,332,032
│    └─InvertedResidual: 2-13                      [128, 96, 14, 14]         [128, 96, 14, 14]         --                        --
│    │    └─Sequential: 3-15                       [128, 96, 14, 14]         [128, 96, 14, 14]         118,272                   2,904,907,776
│    └─InvertedResidual: 2-14                      [128, 96, 14, 14]         [128, 96, 14, 14]         --                        --
│    │    └─Sequential: 3-16                       [128, 96, 14, 14]         [128, 96, 14, 14]         118,272                   2,904,907,776
│    └─InvertedResidual: 2-15                      [128, 96, 14, 14]         [128, 160, 7, 7]          --                        --
│    │    └─Sequential: 3-17                       [128, 96, 14, 14]         [128, 160, 7, 7]          155,264                   1,998,143,488
│    └─InvertedResidual: 2-16                      [128, 160, 7, 7]          [128, 160, 7, 7]          --                        --
│    │    └─Sequential: 3-18                       [128, 160, 7, 7]          [128, 160, 7, 7]          320,000                   1,981,480,960
│    └─InvertedResidual: 2-17                      [128, 160, 7, 7]          [128, 160, 7, 7]          --                        --
│    │    └─Sequential: 3-19                       [128, 160, 7, 7]          [128, 160, 7, 7]          320,000                   1,981,480,960
│    └─InvertedResidual: 2-18                      [128, 160, 7, 7]          [128, 320, 7, 7]          --                        --
│    │    └─Sequential: 3-20                       [128, 160, 7, 7]          [128, 320, 7, 7]          473,920                   2,944,901,120
│    └─Conv2dNormActivation: 2-19                  [128, 320, 7, 7]          [128, 1280, 7, 7]         --                        --
│    │    └─Conv2d: 3-21                           [128, 320, 7, 7]          [128, 1280, 7, 7]         409,600                   2,569,011,200
│    │    └─BatchNorm2d: 3-22                      [128, 1280, 7, 7]         [128, 1280, 7, 7]         2,560                     327,680
│    │    └─ReLU6: 3-23                            [128, 1280, 7, 7]         [128, 1280, 7, 7]         --                        --
├─Sequential: 1-2                                  [128, 1280]               [128, 1000]               --                        --
│    └─Dropout: 2-20                               [128, 1280]               [128, 1280]               --                        --
│    └─Linear: 2-21                                [128, 1280]               [128, 1000]               1,281,000                 163,968,000
======================================================================================================================================================
Total params: 3,504,872
Trainable params: 3,504,872
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 38.50
======================================================================================================================================================
Input size (MB): 77.07
Forward/backward pass size (MB): 13677.80
Params size (MB): 14.02
Estimated Total Size (MB): 13768.89
======================================================================================================================================================