============================================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Param #                   Mult-Adds
============================================================================================================================================
ResNet                                   [16, 3, 224, 224]         [16, 1000]                --                        --
├─Conv2d: 1-1                            [16, 3, 224, 224]         [16, 64, 112, 112]        9,408                     1,888,223,232
├─BatchNorm2d: 1-2                       [16, 64, 112, 112]        [16, 64, 112, 112]        128                       2,048
├─ReLU: 1-3                              [16, 64, 112, 112]        [16, 64, 112, 112]        --                        --
├─MaxPool2d: 1-4                         [16, 64, 112, 112]        [16, 64, 56, 56]          --                        --
├─Sequential: 1-5                        [16, 64, 56, 56]          [16, 256, 56, 56]         --                        --
│    └─Bottleneck: 2-1                   [16, 64, 56, 56]          [16, 256, 56, 56]         --                        --
│    │    └─Conv2d: 3-1                  [16, 64, 56, 56]          [16, 64, 56, 56]          4,096                     205,520,896
│    │    └─BatchNorm2d: 3-2             [16, 64, 56, 56]          [16, 64, 56, 56]          128                       2,048
│    │    └─ReLU: 3-3                    [16, 64, 56, 56]          [16, 64, 56, 56]          --                        --
│    │    └─Conv2d: 3-4                  [16, 64, 56, 56]          [16, 64, 56, 56]          36,864                    1,849,688,064
│    │    └─BatchNorm2d: 3-5             [16, 64, 56, 56]          [16, 64, 56, 56]          128                       2,048
│    │    └─ReLU: 3-6                    [16, 64, 56, 56]          [16, 64, 56, 56]          --                        --
│    │    └─Conv2d: 3-7                  [16, 64, 56, 56]          [16, 256, 56, 56]         16,384                    822,083,584
│    │    └─BatchNorm2d: 3-8             [16, 256, 56, 56]         [16, 256, 56, 56]         512                       8,192
│    │    └─Sequential: 3-9              [16, 64, 56, 56]          [16, 256, 56, 56]         16,896                    822,091,776
│    │    └─ReLU: 3-10                   [16, 256, 56, 56]         [16, 256, 56, 56]         --                        --
│    └─Bottleneck: 2-2                   [16, 256, 56, 56]         [16, 256, 56, 56]         --                        --
│    │    └─Conv2d: 3-11                 [16, 256, 56, 56]         [16, 64, 56, 56]          16,384                    822,083,584
│    │    └─BatchNorm2d: 3-12            [16, 64, 56, 56]          [16, 64, 56, 56]          128                       2,048
│    │    └─ReLU: 3-13                   [16, 64, 56, 56]          [16, 64, 56, 56]          --                        --
│    │    └─Conv2d: 3-14                 [16, 64, 56, 56]          [16, 64, 56, 56]          36,864                    1,849,688,064
│    │    └─BatchNorm2d: 3-15            [16, 64, 56, 56]          [16, 64, 56, 56]          128                       2,048
│    │    └─ReLU: 3-16                   [16, 64, 56, 56]          [16, 64, 56, 56]          --                        --
│    │    └─Conv2d: 3-17                 [16, 64, 56, 56]          [16, 256, 56, 56]         16,384                    822,083,584
│    │    └─BatchNorm2d: 3-18            [16, 256, 56, 56]         [16, 256, 56, 56]         512                       8,192
│    │    └─ReLU: 3-19                   [16, 256, 56, 56]         [16, 256, 56, 56]         --                        --
│    └─Bottleneck: 2-3                   [16, 256, 56, 56]         [16, 256, 56, 56]         --                        --
│    │    └─Conv2d: 3-20                 [16, 256, 56, 56]         [16, 64, 56, 56]          16,384                    822,083,584
│    │    └─BatchNorm2d: 3-21            [16, 64, 56, 56]          [16, 64, 56, 56]          128                       2,048
│    │    └─ReLU: 3-22                   [16, 64, 56, 56]          [16, 64, 56, 56]          --                        --
│    │    └─Conv2d: 3-23                 [16, 64, 56, 56]          [16, 64, 56, 56]          36,864                    1,849,688,064
│    │    └─BatchNorm2d: 3-24            [16, 64, 56, 56]          [16, 64, 56, 56]          128                       2,048
│    │    └─ReLU: 3-25                   [16, 64, 56, 56]          [16, 64, 56, 56]          --                        --
│    │    └─Conv2d: 3-26                 [16, 64, 56, 56]          [16, 256, 56, 56]         16,384                    822,083,584
│    │    └─BatchNorm2d: 3-27            [16, 256, 56, 56]         [16, 256, 56, 56]         512                       8,192
│    │    └─ReLU: 3-28                   [16, 256, 56, 56]         [16, 256, 56, 56]         --                        --
├─Sequential: 1-6                        [16, 256, 56, 56]         [16, 512, 28, 28]         --                        --
│    └─Bottleneck: 2-4                   [16, 256, 56, 56]         [16, 512, 28, 28]         --                        --
│    │    └─Conv2d: 3-29                 [16, 256, 56, 56]         [16, 128, 56, 56]         32,768                    1,644,167,168
│    │    └─BatchNorm2d: 3-30            [16, 128, 56, 56]         [16, 128, 56, 56]         256                       4,096
│    │    └─ReLU: 3-31                   [16, 128, 56, 56]         [16, 128, 56, 56]         --                        --
│    │    └─Conv2d: 3-32                 [16, 128, 56, 56]         [16, 128, 28, 28]         147,456                   1,849,688,064
│    │    └─BatchNorm2d: 3-33            [16, 128, 28, 28]         [16, 128, 28, 28]         256                       4,096
│    │    └─ReLU: 3-34                   [16, 128, 28, 28]         [16, 128, 28, 28]         --                        --
│    │    └─Conv2d: 3-35                 [16, 128, 28, 28]         [16, 512, 28, 28]         65,536                    822,083,584
│    │    └─BatchNorm2d: 3-36            [16, 512, 28, 28]         [16, 512, 28, 28]         1,024                     16,384
│    │    └─Sequential: 3-37             [16, 256, 56, 56]         [16, 512, 28, 28]         132,096                   1,644,183,552
│    │    └─ReLU: 3-38                   [16, 512, 28, 28]         [16, 512, 28, 28]         --                        --
│    └─Bottleneck: 2-5                   [16, 512, 28, 28]         [16, 512, 28, 28]         --                        --
│    │    └─Conv2d: 3-39                 [16, 512, 28, 28]         [16, 128, 28, 28]         65,536                    822,083,584
│    │    └─BatchNorm2d: 3-40            [16, 128, 28, 28]         [16, 128, 28, 28]         256                       4,096
│    │    └─ReLU: 3-41                   [16, 128, 28, 28]         [16, 128, 28, 28]         --                        --
│    │    └─Conv2d: 3-42                 [16, 128, 28, 28]         [16, 128, 28, 28]         147,456                   1,849,688,064
│    │    └─BatchNorm2d: 3-43            [16, 128, 28, 28]         [16, 128, 28, 28]         256                       4,096
│    │    └─ReLU: 3-44                   [16, 128, 28, 28]         [16, 128, 28, 28]         --                        --
│    │    └─Conv2d: 3-45                 [16, 128, 28, 28]         [16, 512, 28, 28]         65,536                    822,083,584
│    │    └─BatchNorm2d: 3-46            [16, 512, 28, 28]         [16, 512, 28, 28]         1,024                     16,384
│    │    └─ReLU: 3-47                   [16, 512, 28, 28]         [16, 512, 28, 28]         --                        --
│    └─Bottleneck: 2-6                   [16, 512, 28, 28]         [16, 512, 28, 28]         --                        --
│    │    └─Conv2d: 3-48                 [16, 512, 28, 28]         [16, 128, 28, 28]         65,536                    822,083,584
│    │    └─BatchNorm2d: 3-49            [16, 128, 28, 28]         [16, 128, 28, 28]         256                       4,096
│    │    └─ReLU: 3-50                   [16, 128, 28, 28]         [16, 128, 28, 28]         --                        --
│    │    └─Conv2d: 3-51                 [16, 128, 28, 28]         [16, 128, 28, 28]         147,456                   1,849,688,064
│    │    └─BatchNorm2d: 3-52            [16, 128, 28, 28]         [16, 128, 28, 28]         256                       4,096
│    │    └─ReLU: 3-53                   [16, 128, 28, 28]         [16, 128, 28, 28]         --                        --
│    │    └─Conv2d: 3-54                 [16, 128, 28, 28]         [16, 512, 28, 28]         65,536                    822,083,584
│    │    └─BatchNorm2d: 3-55            [16, 512, 28, 28]         [16, 512, 28, 28]         1,024                     16,384
│    │    └─ReLU: 3-56                   [16, 512, 28, 28]         [16, 512, 28, 28]         --                        --
│    └─Bottleneck: 2-7                   [16, 512, 28, 28]         [16, 512, 28, 28]         --                        --
│    │    └─Conv2d: 3-57                 [16, 512, 28, 28]         [16, 128, 28, 28]         65,536                    822,083,584
│    │    └─BatchNorm2d: 3-58            [16, 128, 28, 28]         [16, 128, 28, 28]         256                       4,096
│    │    └─ReLU: 3-59                   [16, 128, 28, 28]         [16, 128, 28, 28]         --                        --
│    │    └─Conv2d: 3-60                 [16, 128, 28, 28]         [16, 128, 28, 28]         147,456                   1,849,688,064
│    │    └─BatchNorm2d: 3-61            [16, 128, 28, 28]         [16, 128, 28, 28]         256                       4,096
│    │    └─ReLU: 3-62                   [16, 128, 28, 28]         [16, 128, 28, 28]         --                        --
│    │    └─Conv2d: 3-63                 [16, 128, 28, 28]         [16, 512, 28, 28]         65,536                    822,083,584
│    │    └─BatchNorm2d: 3-64            [16, 512, 28, 28]         [16, 512, 28, 28]         1,024                     16,384
│    │    └─ReLU: 3-65                   [16, 512, 28, 28]         [16, 512, 28, 28]         --                        --
├─Sequential: 1-7                        [16, 512, 28, 28]         [16, 1024, 14, 14]        --                        --
│    └─Bottleneck: 2-8                   [16, 512, 28, 28]         [16, 1024, 14, 14]        --                        --
│    │    └─Conv2d: 3-66                 [16, 512, 28, 28]         [16, 256, 28, 28]         131,072                   1,644,167,168
│    │    └─BatchNorm2d: 3-67            [16, 256, 28, 28]         [16, 256, 28, 28]         512                       8,192
│    │    └─ReLU: 3-68                   [16, 256, 28, 28]         [16, 256, 28, 28]         --                        --
│    │    └─Conv2d: 3-69                 [16, 256, 28, 28]         [16, 256, 14, 14]         589,824                   1,849,688,064
│    │    └─BatchNorm2d: 3-70            [16, 256, 14, 14]         [16, 256, 14, 14]         512                       8,192
│    │    └─ReLU: 3-71                   [16, 256, 14, 14]         [16, 256, 14, 14]         --                        --
│    │    └─Conv2d: 3-72                 [16, 256, 14, 14]         [16, 1024, 14, 14]        262,144                   822,083,584
│    │    └─BatchNorm2d: 3-73            [16, 1024, 14, 14]        [16, 1024, 14, 14]        2,048                     32,768
│    │    └─Sequential: 3-74             [16, 512, 28, 28]         [16, 1024, 14, 14]        526,336                   1,644,199,936
│    │    └─ReLU: 3-75                   [16, 1024, 14, 14]        [16, 1024, 14, 14]        --                        --
│    └─Bottleneck: 2-9                   [16, 1024, 14, 14]        [16, 1024, 14, 14]        --                        --
│    │    └─Conv2d: 3-76                 [16, 1024, 14, 14]        [16, 256, 14, 14]         262,144                   822,083,584
│    │    └─BatchNorm2d: 3-77            [16, 256, 14, 14]         [16, 256, 14, 14]         512                       8,192
│    │    └─ReLU: 3-78                   [16, 256, 14, 14]         [16, 256, 14, 14]         --                        --
│    │    └─Conv2d: 3-79                 [16, 256, 14, 14]         [16, 256, 14, 14]         589,824                   1,849,688,064
│    │    └─BatchNorm2d: 3-80            [16, 256, 14, 14]         [16, 256, 14, 14]         512                       8,192
│    │    └─ReLU: 3-81                   [16, 256, 14, 14]         [16, 256, 14, 14]         --                        --
│    │    └─Conv2d: 3-82                 [16, 256, 14, 14]         [16, 1024, 14, 14]        262,144                   822,083,584
│    │    └─BatchNorm2d: 3-83            [16, 1024, 14, 14]        [16, 1024, 14, 14]        2,048                     32,768
│    │    └─ReLU: 3-84                   [16, 1024, 14, 14]        [16, 1024, 14, 14]        --                        --
│    └─Bottleneck: 2-10                  [16, 1024, 14, 14]        [16, 1024, 14, 14]        --                        --
│    │    └─Conv2d: 3-85                 [16, 1024, 14, 14]        [16, 256, 14, 14]         262,144                   822,083,584
│    │    └─BatchNorm2d: 3-86            [16, 256, 14, 14]         [16, 256, 14, 14]         512                       8,192
│    │    └─ReLU: 3-87                   [16, 256, 14, 14]         [16, 256, 14, 14]         --                        --
│    │    └─Conv2d: 3-88                 [16, 256, 14, 14]         [16, 256, 14, 14]         589,824                   1,849,688,064
│    │    └─BatchNorm2d: 3-89            [16, 256, 14, 14]         [16, 256, 14, 14]         512                       8,192
│    │    └─ReLU: 3-90                   [16, 256, 14, 14]         [16, 256, 14, 14]         --                        --
│    │    └─Conv2d: 3-91                 [16, 256, 14, 14]         [16, 1024, 14, 14]        262,144                   822,083,584
│    │    └─BatchNorm2d: 3-92            [16, 1024, 14, 14]        [16, 1024, 14, 14]        2,048                     32,768
│    │    └─ReLU: 3-93                   [16, 1024, 14, 14]        [16, 1024, 14, 14]        --                        --
│    └─Bottleneck: 2-11                  [16, 1024, 14, 14]        [16, 1024, 14, 14]        --                        --
│    │    └─Conv2d: 3-94                 [16, 1024, 14, 14]        [16, 256, 14, 14]         262,144                   822,083,584
│    │    └─BatchNorm2d: 3-95            [16, 256, 14, 14]         [16, 256, 14, 14]         512                       8,192
│    │    └─ReLU: 3-96                   [16, 256, 14, 14]         [16, 256, 14, 14]         --                        --
│    │    └─Conv2d: 3-97                 [16, 256, 14, 14]         [16, 256, 14, 14]         589,824                   1,849,688,064
│    │    └─BatchNorm2d: 3-98            [16, 256, 14, 14]         [16, 256, 14, 14]         512                       8,192
│    │    └─ReLU: 3-99                   [16, 256, 14, 14]         [16, 256, 14, 14]         --                        --
│    │    └─Conv2d: 3-100                [16, 256, 14, 14]         [16, 1024, 14, 14]        262,144                   822,083,584
│    │    └─BatchNorm2d: 3-101           [16, 1024, 14, 14]        [16, 1024, 14, 14]        2,048                     32,768
│    │    └─ReLU: 3-102                  [16, 1024, 14, 14]        [16, 1024, 14, 14]        --                        --
│    └─Bottleneck: 2-12                  [16, 1024, 14, 14]        [16, 1024, 14, 14]        --                        --
│    │    └─Conv2d: 3-103                [16, 1024, 14, 14]        [16, 256, 14, 14]         262,144                   822,083,584
│    │    └─BatchNorm2d: 3-104           [16, 256, 14, 14]         [16, 256, 14, 14]         512                       8,192
│    │    └─ReLU: 3-105                  [16, 256, 14, 14]         [16, 256, 14, 14]         --                        --
│    │    └─Conv2d: 3-106                [16, 256, 14, 14]         [16, 256, 14, 14]         589,824                   1,849,688,064
│    │    └─BatchNorm2d: 3-107           [16, 256, 14, 14]         [16, 256, 14, 14]         512                       8,192
│    │    └─ReLU: 3-108                  [16, 256, 14, 14]         [16, 256, 14, 14]         --                        --
│    │    └─Conv2d: 3-109                [16, 256, 14, 14]         [16, 1024, 14, 14]        262,144                   822,083,584
│    │    └─BatchNorm2d: 3-110           [16, 1024, 14, 14]        [16, 1024, 14, 14]        2,048                     32,768
│    │    └─ReLU: 3-111                  [16, 1024, 14, 14]        [16, 1024, 14, 14]        --                        --
│    └─Bottleneck: 2-13                  [16, 1024, 14, 14]        [16, 1024, 14, 14]        --                        --
│    │    └─Conv2d: 3-112                [16, 1024, 14, 14]        [16, 256, 14, 14]         262,144                   822,083,584
│    │    └─BatchNorm2d: 3-113           [16, 256, 14, 14]         [16, 256, 14, 14]         512                       8,192
│    │    └─ReLU: 3-114                  [16, 256, 14, 14]         [16, 256, 14, 14]         --                        --
│    │    └─Conv2d: 3-115                [16, 256, 14, 14]         [16, 256, 14, 14]         589,824                   1,849,688,064
│    │    └─BatchNorm2d: 3-116           [16, 256, 14, 14]         [16, 256, 14, 14]         512                       8,192
│    │    └─ReLU: 3-117                  [16, 256, 14, 14]         [16, 256, 14, 14]         --                        --
│    │    └─Conv2d: 3-118                [16, 256, 14, 14]         [16, 1024, 14, 14]        262,144                   822,083,584
│    │    └─BatchNorm2d: 3-119           [16, 1024, 14, 14]        [16, 1024, 14, 14]        2,048                     32,768
│    │    └─ReLU: 3-120                  [16, 1024, 14, 14]        [16, 1024, 14, 14]        --                        --
├─Sequential: 1-8                        [16, 1024, 14, 14]        [16, 2048, 7, 7]          --                        --
│    └─Bottleneck: 2-14                  [16, 1024, 14, 14]        [16, 2048, 7, 7]          --                        --
│    │    └─Conv2d: 3-121                [16, 1024, 14, 14]        [16, 512, 14, 14]         524,288                   1,644,167,168
│    │    └─BatchNorm2d: 3-122           [16, 512, 14, 14]         [16, 512, 14, 14]         1,024                     16,384
│    │    └─ReLU: 3-123                  [16, 512, 14, 14]         [16, 512, 14, 14]         --                        --
│    │    └─Conv2d: 3-124                [16, 512, 14, 14]         [16, 512, 7, 7]           2,359,296                 1,849,688,064
│    │    └─BatchNorm2d: 3-125           [16, 512, 7, 7]           [16, 512, 7, 7]           1,024                     16,384
│    │    └─ReLU: 3-126                  [16, 512, 7, 7]           [16, 512, 7, 7]           --                        --
│    │    └─Conv2d: 3-127                [16, 512, 7, 7]           [16, 2048, 7, 7]          1,048,576                 822,083,584
│    │    └─BatchNorm2d: 3-128           [16, 2048, 7, 7]          [16, 2048, 7, 7]          4,096                     65,536
│    │    └─Sequential: 3-129            [16, 1024, 14, 14]        [16, 2048, 7, 7]          2,101,248                 1,644,232,704
│    │    └─ReLU: 3-130                  [16, 2048, 7, 7]          [16, 2048, 7, 7]          --                        --
│    └─Bottleneck: 2-15                  [16, 2048, 7, 7]          [16, 2048, 7, 7]          --                        --
│    │    └─Conv2d: 3-131                [16, 2048, 7, 7]          [16, 512, 7, 7]           1,048,576                 822,083,584
│    │    └─BatchNorm2d: 3-132           [16, 512, 7, 7]           [16, 512, 7, 7]           1,024                     16,384
│    │    └─ReLU: 3-133                  [16, 512, 7, 7]           [16, 512, 7, 7]           --                        --
│    │    └─Conv2d: 3-134                [16, 512, 7, 7]           [16, 512, 7, 7]           2,359,296                 1,849,688,064
│    │    └─BatchNorm2d: 3-135           [16, 512, 7, 7]           [16, 512, 7, 7]           1,024                     16,384
│    │    └─ReLU: 3-136                  [16, 512, 7, 7]           [16, 512, 7, 7]           --                        --
│    │    └─Conv2d: 3-137                [16, 512, 7, 7]           [16, 2048, 7, 7]          1,048,576                 822,083,584
│    │    └─BatchNorm2d: 3-138           [16, 2048, 7, 7]          [16, 2048, 7, 7]          4,096                     65,536
│    │    └─ReLU: 3-139                  [16, 2048, 7, 7]          [16, 2048, 7, 7]          --                        --
│    └─Bottleneck: 2-16                  [16, 2048, 7, 7]          [16, 2048, 7, 7]          --                        --
│    │    └─Conv2d: 3-140                [16, 2048, 7, 7]          [16, 512, 7, 7]           1,048,576                 822,083,584
│    │    └─BatchNorm2d: 3-141           [16, 512, 7, 7]           [16, 512, 7, 7]           1,024                     16,384
│    │    └─ReLU: 3-142                  [16, 512, 7, 7]           [16, 512, 7, 7]           --                        --
│    │    └─Conv2d: 3-143                [16, 512, 7, 7]           [16, 512, 7, 7]           2,359,296                 1,849,688,064
│    │    └─BatchNorm2d: 3-144           [16, 512, 7, 7]           [16, 512, 7, 7]           1,024                     16,384
│    │    └─ReLU: 3-145                  [16, 512, 7, 7]           [16, 512, 7, 7]           --                        --
│    │    └─Conv2d: 3-146                [16, 512, 7, 7]           [16, 2048, 7, 7]          1,048,576                 822,083,584
│    │    └─BatchNorm2d: 3-147           [16, 2048, 7, 7]          [16, 2048, 7, 7]          4,096                     65,536
│    │    └─ReLU: 3-148                  [16, 2048, 7, 7]          [16, 2048, 7, 7]          --                        --
├─AdaptiveAvgPool2d: 1-9                 [16, 2048, 7, 7]          [16, 2048, 1, 1]          --                        --
├─Linear: 1-10                           [16, 2048]                [16, 1000]                2,049,000                 32,784,000
============================================================================================================================================
Total params: 25,557,032
Trainable params: 25,557,032
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 65.43
============================================================================================================================================
Input size (MB): 9.63
Forward/backward pass size (MB): 2845.31
Params size (MB): 102.23
Estimated Total Size (MB): 2957.17
============================================================================================================================================