============================================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Param #                   Mult-Adds
============================================================================================================================================
VGG                                      [32, 3, 224, 224]         [32, 1000]                --                        --
├─Sequential: 1-1                        [32, 3, 224, 224]         [32, 512, 7, 7]           --                        --
│    └─Conv2d: 2-1                       [32, 3, 224, 224]         [32, 64, 224, 224]        1,792                     2,877,292,544
│    └─ReLU: 2-2                         [32, 64, 224, 224]        [32, 64, 224, 224]        --                        --
│    └─Conv2d: 2-3                       [32, 64, 224, 224]        [32, 64, 224, 224]        36,928                    59,292,778,496
│    └─ReLU: 2-4                         [32, 64, 224, 224]        [32, 64, 224, 224]        --                        --
│    └─MaxPool2d: 2-5                    [32, 64, 224, 224]        [32, 64, 112, 112]        --                        --
│    └─Conv2d: 2-6                       [32, 64, 112, 112]        [32, 128, 112, 112]       73,856                    29,646,389,248
│    └─ReLU: 2-7                         [32, 128, 112, 112]       [32, 128, 112, 112]       --                        --
│    └─Conv2d: 2-8                       [32, 128, 112, 112]       [32, 128, 112, 112]       147,584                   59,241,398,272
│    └─ReLU: 2-9                         [32, 128, 112, 112]       [32, 128, 112, 112]       --                        --
│    └─MaxPool2d: 2-10                   [32, 128, 112, 112]       [32, 128, 56, 56]         --                        --
│    └─Conv2d: 2-11                      [32, 128, 56, 56]         [32, 256, 56, 56]         295,168                   29,620,699,136
│    └─ReLU: 2-12                        [32, 256, 56, 56]         [32, 256, 56, 56]         --                        --
│    └─Conv2d: 2-13                      [32, 256, 56, 56]         [32, 256, 56, 56]         590,080                   59,215,708,160
│    └─ReLU: 2-14                        [32, 256, 56, 56]         [32, 256, 56, 56]         --                        --
│    └─Conv2d: 2-15                      [32, 256, 56, 56]         [32, 256, 56, 56]         590,080                   59,215,708,160
│    └─ReLU: 2-16                        [32, 256, 56, 56]         [32, 256, 56, 56]         --                        --
│    └─MaxPool2d: 2-17                   [32, 256, 56, 56]         [32, 256, 28, 28]         --                        --
│    └─Conv2d: 2-18                      [32, 256, 28, 28]         [32, 512, 28, 28]         1,180,160                 29,607,854,080
│    └─ReLU: 2-19                        [32, 512, 28, 28]         [32, 512, 28, 28]         --                        --
│    └─Conv2d: 2-20                      [32, 512, 28, 28]         [32, 512, 28, 28]         2,359,808                 59,202,863,104
│    └─ReLU: 2-21                        [32, 512, 28, 28]         [32, 512, 28, 28]         --                        --
│    └─Conv2d: 2-22                      [32, 512, 28, 28]         [32, 512, 28, 28]         2,359,808                 59,202,863,104
│    └─ReLU: 2-23                        [32, 512, 28, 28]         [32, 512, 28, 28]         --                        --
│    └─MaxPool2d: 2-24                   [32, 512, 28, 28]         [32, 512, 14, 14]         --                        --
│    └─Conv2d: 2-25                      [32, 512, 14, 14]         [32, 512, 14, 14]         2,359,808                 14,800,715,776
│    └─ReLU: 2-26                        [32, 512, 14, 14]         [32, 512, 14, 14]         --                        --
│    └─Conv2d: 2-27                      [32, 512, 14, 14]         [32, 512, 14, 14]         2,359,808                 14,800,715,776
│    └─ReLU: 2-28                        [32, 512, 14, 14]         [32, 512, 14, 14]         --                        --
│    └─Conv2d: 2-29                      [32, 512, 14, 14]         [32, 512, 14, 14]         2,359,808                 14,800,715,776
│    └─ReLU: 2-30                        [32, 512, 14, 14]         [32, 512, 14, 14]         --                        --
│    └─MaxPool2d: 2-31                   [32, 512, 14, 14]         [32, 512, 7, 7]           --                        --
├─AdaptiveAvgPool2d: 1-2                 [32, 512, 7, 7]           [32, 512, 7, 7]           --                        --
├─Sequential: 1-3                        [32, 25088]               [32, 1000]                --                        --
│    └─Linear: 2-32                      [32, 25088]               [32, 4096]                102,764,544               3,288,465,408
│    └─ReLU: 2-33                        [32, 4096]                [32, 4096]                --                        --
│    └─Dropout: 2-34                     [32, 4096]                [32, 4096]                --                        --
│    └─Linear: 2-35                      [32, 4096]                [32, 4096]                16,781,312                537,001,984
│    └─ReLU: 2-36                        [32, 4096]                [32, 4096]                --                        --
│    └─Dropout: 2-37                     [32, 4096]                [32, 4096]                --                        --
│    └─Linear: 2-38                      [32, 4096]                [32, 1000]                4,097,000                 131,104,000
============================================================================================================================================
Total params: 138,357,544
Trainable params: 138,357,544
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 495.48
============================================================================================================================================
Input size (MB): 19.27
Forward/backward pass size (MB): 3470.52
Params size (MB): 553.43
Estimated Total Size (MB): 4043.22
============================================================================================================================================