============================================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Param #                   Mult-Adds
============================================================================================================================================
VGG                                      [128, 3, 224, 224]        [128, 1000]               --                        --
├─Sequential: 1-1                        [128, 3, 224, 224]        [128, 512, 7, 7]          --                        --
│    └─Conv2d: 2-1                       [128, 3, 224, 224]        [128, 64, 224, 224]       1,792                     11,509,170,176
│    └─ReLU: 2-2                         [128, 64, 224, 224]       [128, 64, 224, 224]       --                        --
│    └─Conv2d: 2-3                       [128, 64, 224, 224]       [128, 64, 224, 224]       36,928                    237,171,113,984
│    └─ReLU: 2-4                         [128, 64, 224, 224]       [128, 64, 224, 224]       --                        --
│    └─MaxPool2d: 2-5                    [128, 64, 224, 224]       [128, 64, 112, 112]       --                        --
│    └─Conv2d: 2-6                       [128, 64, 112, 112]       [128, 128, 112, 112]      73,856                    118,585,556,992
│    └─ReLU: 2-7                         [128, 128, 112, 112]      [128, 128, 112, 112]      --                        --
│    └─Conv2d: 2-8                       [128, 128, 112, 112]      [128, 128, 112, 112]      147,584                   236,965,593,088
│    └─ReLU: 2-9                         [128, 128, 112, 112]      [128, 128, 112, 112]      --                        --
│    └─MaxPool2d: 2-10                   [128, 128, 112, 112]      [128, 128, 56, 56]        --                        --
│    └─Conv2d: 2-11                      [128, 128, 56, 56]        [128, 256, 56, 56]        295,168                   118,482,796,544
│    └─ReLU: 2-12                        [128, 256, 56, 56]        [128, 256, 56, 56]        --                        --
│    └─Conv2d: 2-13                      [128, 256, 56, 56]        [128, 256, 56, 56]        590,080                   236,862,832,640
│    └─ReLU: 2-14                        [128, 256, 56, 56]        [128, 256, 56, 56]        --                        --
│    └─Conv2d: 2-15                      [128, 256, 56, 56]        [128, 256, 56, 56]        590,080                   236,862,832,640
│    └─ReLU: 2-16                        [128, 256, 56, 56]        [128, 256, 56, 56]        --                        --
│    └─MaxPool2d: 2-17                   [128, 256, 56, 56]        [128, 256, 28, 28]        --                        --
│    └─Conv2d: 2-18                      [128, 256, 28, 28]        [128, 512, 28, 28]        1,180,160                 118,431,416,320
│    └─ReLU: 2-19                        [128, 512, 28, 28]        [128, 512, 28, 28]        --                        --
│    └─Conv2d: 2-20                      [128, 512, 28, 28]        [128, 512, 28, 28]        2,359,808                 236,811,452,416
│    └─ReLU: 2-21                        [128, 512, 28, 28]        [128, 512, 28, 28]        --                        --
│    └─Conv2d: 2-22                      [128, 512, 28, 28]        [128, 512, 28, 28]        2,359,808                 236,811,452,416
│    └─ReLU: 2-23                        [128, 512, 28, 28]        [128, 512, 28, 28]        --                        --
│    └─MaxPool2d: 2-24                   [128, 512, 28, 28]        [128, 512, 14, 14]        --                        --
│    └─Conv2d: 2-25                      [128, 512, 14, 14]        [128, 512, 14, 14]        2,359,808                 59,202,863,104
│    └─ReLU: 2-26                        [128, 512, 14, 14]        [128, 512, 14, 14]        --                        --
│    └─Conv2d: 2-27                      [128, 512, 14, 14]        [128, 512, 14, 14]        2,359,808                 59,202,863,104
│    └─ReLU: 2-28                        [128, 512, 14, 14]        [128, 512, 14, 14]        --                        --
│    └─Conv2d: 2-29                      [128, 512, 14, 14]        [128, 512, 14, 14]        2,359,808                 59,202,863,104
│    └─ReLU: 2-30                        [128, 512, 14, 14]        [128, 512, 14, 14]        --                        --
│    └─MaxPool2d: 2-31                   [128, 512, 14, 14]        [128, 512, 7, 7]          --                        --
├─AdaptiveAvgPool2d: 1-2                 [128, 512, 7, 7]          [128, 512, 7, 7]          --                        --
├─Sequential: 1-3                        [128, 25088]              [128, 1000]               --                        --
│    └─Linear: 2-32                      [128, 25088]              [128, 4096]               102,764,544               13,153,861,632
│    └─ReLU: 2-33                        [128, 4096]               [128, 4096]               --                        --
│    └─Dropout: 2-34                     [128, 4096]               [128, 4096]               --                        --
│    └─Linear: 2-35                      [128, 4096]               [128, 4096]               16,781,312                2,148,007,936
│    └─ReLU: 2-36                        [128, 4096]               [128, 4096]               --                        --
│    └─Dropout: 2-37                     [128, 4096]               [128, 4096]               --                        --
│    └─Linear: 2-38                      [128, 4096]               [128, 1000]               4,097,000                 524,416,000
============================================================================================================================================
Total params: 138,357,544
Trainable params: 138,357,544
Non-trainable params: 0
Total mult-adds (Units.TERABYTES): 1.98
============================================================================================================================================
Input size (MB): 77.07
Forward/backward pass size (MB): 13882.07
Params size (MB): 553.43
Estimated Total Size (MB): 14512.57
============================================================================================================================================