============================================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Param #                   Mult-Adds
============================================================================================================================================
VGG                                      [64, 3, 224, 224]         [64, 1000]                --                        --
├─Sequential: 1-1                        [64, 3, 224, 224]         [64, 512, 7, 7]           --                        --
│    └─Conv2d: 2-1                       [64, 3, 224, 224]         [64, 64, 224, 224]        1,792                     5,754,585,088
│    └─ReLU: 2-2                         [64, 64, 224, 224]        [64, 64, 224, 224]        --                        --
│    └─Conv2d: 2-3                       [64, 64, 224, 224]        [64, 64, 224, 224]        36,928                    118,585,556,992
│    └─ReLU: 2-4                         [64, 64, 224, 224]        [64, 64, 224, 224]        --                        --
│    └─MaxPool2d: 2-5                    [64, 64, 224, 224]        [64, 64, 112, 112]        --                        --
│    └─Conv2d: 2-6                       [64, 64, 112, 112]        [64, 128, 112, 112]       73,856                    59,292,778,496
│    └─ReLU: 2-7                         [64, 128, 112, 112]       [64, 128, 112, 112]       --                        --
│    └─Conv2d: 2-8                       [64, 128, 112, 112]       [64, 128, 112, 112]       147,584                   118,482,796,544
│    └─ReLU: 2-9                         [64, 128, 112, 112]       [64, 128, 112, 112]       --                        --
│    └─MaxPool2d: 2-10                   [64, 128, 112, 112]       [64, 128, 56, 56]         --                        --
│    └─Conv2d: 2-11                      [64, 128, 56, 56]         [64, 256, 56, 56]         295,168                   59,241,398,272
│    └─ReLU: 2-12                        [64, 256, 56, 56]         [64, 256, 56, 56]         --                        --
│    └─Conv2d: 2-13                      [64, 256, 56, 56]         [64, 256, 56, 56]         590,080                   118,431,416,320
│    └─ReLU: 2-14                        [64, 256, 56, 56]         [64, 256, 56, 56]         --                        --
│    └─Conv2d: 2-15                      [64, 256, 56, 56]         [64, 256, 56, 56]         590,080                   118,431,416,320
│    └─ReLU: 2-16                        [64, 256, 56, 56]         [64, 256, 56, 56]         --                        --
│    └─MaxPool2d: 2-17                   [64, 256, 56, 56]         [64, 256, 28, 28]         --                        --
│    └─Conv2d: 2-18                      [64, 256, 28, 28]         [64, 512, 28, 28]         1,180,160                 59,215,708,160
│    └─ReLU: 2-19                        [64, 512, 28, 28]         [64, 512, 28, 28]         --                        --
│    └─Conv2d: 2-20                      [64, 512, 28, 28]         [64, 512, 28, 28]         2,359,808                 118,405,726,208
│    └─ReLU: 2-21                        [64, 512, 28, 28]         [64, 512, 28, 28]         --                        --
│    └─Conv2d: 2-22                      [64, 512, 28, 28]         [64, 512, 28, 28]         2,359,808                 118,405,726,208
│    └─ReLU: 2-23                        [64, 512, 28, 28]         [64, 512, 28, 28]         --                        --
│    └─MaxPool2d: 2-24                   [64, 512, 28, 28]         [64, 512, 14, 14]         --                        --
│    └─Conv2d: 2-25                      [64, 512, 14, 14]         [64, 512, 14, 14]         2,359,808                 29,601,431,552
│    └─ReLU: 2-26                        [64, 512, 14, 14]         [64, 512, 14, 14]         --                        --
│    └─Conv2d: 2-27                      [64, 512, 14, 14]         [64, 512, 14, 14]         2,359,808                 29,601,431,552
│    └─ReLU: 2-28                        [64, 512, 14, 14]         [64, 512, 14, 14]         --                        --
│    └─Conv2d: 2-29                      [64, 512, 14, 14]         [64, 512, 14, 14]         2,359,808                 29,601,431,552
│    └─ReLU: 2-30                        [64, 512, 14, 14]         [64, 512, 14, 14]         --                        --
│    └─MaxPool2d: 2-31                   [64, 512, 14, 14]         [64, 512, 7, 7]           --                        --
├─AdaptiveAvgPool2d: 1-2                 [64, 512, 7, 7]           [64, 512, 7, 7]           --                        --
├─Sequential: 1-3                        [64, 25088]               [64, 1000]                --                        --
│    └─Linear: 2-32                      [64, 25088]               [64, 4096]                102,764,544               6,576,930,816
│    └─ReLU: 2-33                        [64, 4096]                [64, 4096]                --                        --
│    └─Dropout: 2-34                     [64, 4096]                [64, 4096]                --                        --
│    └─Linear: 2-35                      [64, 4096]                [64, 4096]                16,781,312                1,074,003,968
│    └─ReLU: 2-36                        [64, 4096]                [64, 4096]                --                        --
│    └─Dropout: 2-37                     [64, 4096]                [64, 4096]                --                        --
│    └─Linear: 2-38                      [64, 4096]                [64, 1000]                4,097,000                 262,208,000
============================================================================================================================================
Total params: 138,357,544
Trainable params: 138,357,544
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 990.96
============================================================================================================================================
Input size (MB): 38.54
Forward/backward pass size (MB): 6941.04
Params size (MB): 553.43
Estimated Total Size (MB): 7533.00
============================================================================================================================================