======================================================================================================================================================
Layer (type:depth-idx)                             Input Shape               Output Shape              Param #                   Mult-Adds
======================================================================================================================================================
MobileNetV2                                        [32, 3, 224, 224]         [32, 1000]                --                        --
├─Sequential: 1-1                                  [32, 3, 224, 224]         [32, 1280, 7, 7]          --                        --
│    └─Conv2dNormActivation: 2-1                   [32, 3, 224, 224]         [32, 32, 112, 112]        --                        --
│    │    └─Conv2d: 3-1                            [32, 3, 224, 224]         [32, 32, 112, 112]        864                       346,816,512
│    │    └─BatchNorm2d: 3-2                       [32, 32, 112, 112]        [32, 32, 112, 112]        64                        2,048
│    │    └─ReLU6: 3-3                             [32, 32, 112, 112]        [32, 32, 112, 112]        --                        --
│    └─InvertedResidual: 2-2                       [32, 32, 112, 112]        [32, 16, 112, 112]        --                        --
│    │    └─Sequential: 3-4                        [32, 32, 112, 112]        [32, 16, 112, 112]        896                       321,129,472
│    └─InvertedResidual: 2-3                       [32, 16, 112, 112]        [32, 24, 56, 56]          --                        --
│    │    └─Sequential: 3-5                        [32, 16, 112, 112]        [32, 24, 56, 56]          5,136                     934,491,648
│    └─InvertedResidual: 2-4                       [32, 24, 56, 56]          [32, 24, 56, 56]          --                        --
│    │    └─Sequential: 3-6                        [32, 24, 56, 56]          [32, 24, 56, 56]          8,832                     823,709,184
│    └─InvertedResidual: 2-5                       [32, 24, 56, 56]          [32, 32, 28, 28]          --                        --
│    │    └─Sequential: 3-7                        [32, 24, 56, 56]          [32, 32, 28, 28]          10,000                    494,956,544
│    └─InvertedResidual: 2-6                       [32, 32, 28, 28]          [32, 32, 28, 28]          --                        --
│    │    └─Sequential: 3-8                        [32, 32, 28, 28]          [32, 32, 28, 28]          14,848                    351,660,032
│    └─InvertedResidual: 2-7                       [32, 32, 28, 28]          [32, 32, 28, 28]          --                        --
│    │    └─Sequential: 3-9                        [32, 32, 28, 28]          [32, 32, 28, 28]          14,848                    351,660,032
│    └─InvertedResidual: 2-8                       [32, 32, 28, 28]          [32, 64, 14, 14]          --                        --
│    │    └─Sequential: 3-10                       [32, 32, 28, 28]          [32, 64, 14, 14]          21,056                    242,077,696
│    └─InvertedResidual: 2-9                       [32, 64, 14, 14]          [32, 64, 14, 14]          --                        --
│    │    └─Sequential: 3-11                       [32, 64, 14, 14]          [32, 64, 14, 14]          54,272                    330,010,624
│    └─InvertedResidual: 2-10                      [32, 64, 14, 14]          [32, 64, 14, 14]          --                        --
│    │    └─Sequential: 3-12                       [32, 64, 14, 14]          [32, 64, 14, 14]          54,272                    330,010,624
│    └─InvertedResidual: 2-11                      [32, 64, 14, 14]          [32, 64, 14, 14]          --                        --
│    │    └─Sequential: 3-13                       [32, 64, 14, 14]          [32, 64, 14, 14]          54,272                    330,010,624
│    └─InvertedResidual: 2-12                      [32, 64, 14, 14]          [32, 96, 14, 14]          --                        --
│    │    └─Sequential: 3-14                       [32, 64, 14, 14]          [32, 96, 14, 14]          66,624                    407,083,008
│    └─InvertedResidual: 2-13                      [32, 96, 14, 14]          [32, 96, 14, 14]          --                        --
│    │    └─Sequential: 3-15                       [32, 96, 14, 14]          [32, 96, 14, 14]          118,272                   726,226,944
│    └─InvertedResidual: 2-14                      [32, 96, 14, 14]          [32, 96, 14, 14]          --                        --
│    │    └─Sequential: 3-16                       [32, 96, 14, 14]          [32, 96, 14, 14]          118,272                   726,226,944
│    └─InvertedResidual: 2-15                      [32, 96, 14, 14]          [32, 160, 7, 7]           --                        --
│    │    └─Sequential: 3-17                       [32, 96, 14, 14]          [32, 160, 7, 7]           155,264                   499,535,872
│    └─InvertedResidual: 2-16                      [32, 160, 7, 7]           [32, 160, 7, 7]           --                        --
│    │    └─Sequential: 3-18                       [32, 160, 7, 7]           [32, 160, 7, 7]           320,000                   495,370,240
│    └─InvertedResidual: 2-17                      [32, 160, 7, 7]           [32, 160, 7, 7]           --                        --
│    │    └─Sequential: 3-19                       [32, 160, 7, 7]           [32, 160, 7, 7]           320,000                   495,370,240
│    └─InvertedResidual: 2-18                      [32, 160, 7, 7]           [32, 320, 7, 7]           --                        --
│    │    └─Sequential: 3-20                       [32, 160, 7, 7]           [32, 320, 7, 7]           473,920                   736,225,280
│    └─Conv2dNormActivation: 2-19                  [32, 320, 7, 7]           [32, 1280, 7, 7]          --                        --
│    │    └─Conv2d: 3-21                           [32, 320, 7, 7]           [32, 1280, 7, 7]          409,600                   642,252,800
│    │    └─BatchNorm2d: 3-22                      [32, 1280, 7, 7]          [32, 1280, 7, 7]          2,560                     81,920
│    │    └─ReLU6: 3-23                            [32, 1280, 7, 7]          [32, 1280, 7, 7]          --                        --
├─Sequential: 1-2                                  [32, 1280]                [32, 1000]                --                        --
│    └─Dropout: 2-20                               [32, 1280]                [32, 1280]                --                        --
│    └─Linear: 2-21                                [32, 1280]                [32, 1000]                1,281,000                 40,992,000
======================================================================================================================================================
Total params: 3,504,872
Trainable params: 3,504,872
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 9.63
======================================================================================================================================================
Input size (MB): 19.27
Forward/backward pass size (MB): 3419.45
Params size (MB): 14.02
Estimated Total Size (MB): 3452.74
======================================================================================================================================================