======================================================================================================================================================
Layer (type:depth-idx)                             Input Shape               Output Shape              Param #                   Mult-Adds
======================================================================================================================================================
MobileNetV2                                        [16, 3, 224, 224]         [16, 1000]                --                        --
├─Sequential: 1-1                                  [16, 3, 224, 224]         [16, 1280, 7, 7]          --                        --
│    └─Conv2dNormActivation: 2-1                   [16, 3, 224, 224]         [16, 32, 112, 112]        --                        --
│    │    └─Conv2d: 3-1                            [16, 3, 224, 224]         [16, 32, 112, 112]        864                       173,408,256
│    │    └─BatchNorm2d: 3-2                       [16, 32, 112, 112]        [16, 32, 112, 112]        64                        1,024
│    │    └─ReLU6: 3-3                             [16, 32, 112, 112]        [16, 32, 112, 112]        --                        --
│    └─InvertedResidual: 2-2                       [16, 32, 112, 112]        [16, 16, 112, 112]        --                        --
│    │    └─Sequential: 3-4                        [16, 32, 112, 112]        [16, 16, 112, 112]        896                       160,564,736
│    └─InvertedResidual: 2-3                       [16, 16, 112, 112]        [16, 24, 56, 56]          --                        --
│    │    └─Sequential: 3-5                        [16, 16, 112, 112]        [16, 24, 56, 56]          5,136                     467,245,824
│    └─InvertedResidual: 2-4                       [16, 24, 56, 56]          [16, 24, 56, 56]          --                        --
│    │    └─Sequential: 3-6                        [16, 24, 56, 56]          [16, 24, 56, 56]          8,832                     411,854,592
│    └─InvertedResidual: 2-5                       [16, 24, 56, 56]          [16, 32, 28, 28]          --                        --
│    │    └─Sequential: 3-7                        [16, 24, 56, 56]          [16, 32, 28, 28]          10,000                    247,478,272
│    └─InvertedResidual: 2-6                       [16, 32, 28, 28]          [16, 32, 28, 28]          --                        --
│    │    └─Sequential: 3-8                        [16, 32, 28, 28]          [16, 32, 28, 28]          14,848                    175,830,016
│    └─InvertedResidual: 2-7                       [16, 32, 28, 28]          [16, 32, 28, 28]          --                        --
│    │    └─Sequential: 3-9                        [16, 32, 28, 28]          [16, 32, 28, 28]          14,848                    175,830,016
│    └─InvertedResidual: 2-8                       [16, 32, 28, 28]          [16, 64, 14, 14]          --                        --
│    │    └─Sequential: 3-10                       [16, 32, 28, 28]          [16, 64, 14, 14]          21,056                    121,038,848
│    └─InvertedResidual: 2-9                       [16, 64, 14, 14]          [16, 64, 14, 14]          --                        --
│    │    └─Sequential: 3-11                       [16, 64, 14, 14]          [16, 64, 14, 14]          54,272                    165,005,312
│    └─InvertedResidual: 2-10                      [16, 64, 14, 14]          [16, 64, 14, 14]          --                        --
│    │    └─Sequential: 3-12                       [16, 64, 14, 14]          [16, 64, 14, 14]          54,272                    165,005,312
│    └─InvertedResidual: 2-11                      [16, 64, 14, 14]          [16, 64, 14, 14]          --                        --
│    │    └─Sequential: 3-13                       [16, 64, 14, 14]          [16, 64, 14, 14]          54,272                    165,005,312
│    └─InvertedResidual: 2-12                      [16, 64, 14, 14]          [16, 96, 14, 14]          --                        --
│    │    └─Sequential: 3-14                       [16, 64, 14, 14]          [16, 96, 14, 14]          66,624                    203,541,504
│    └─InvertedResidual: 2-13                      [16, 96, 14, 14]          [16, 96, 14, 14]          --                        --
│    │    └─Sequential: 3-15                       [16, 96, 14, 14]          [16, 96, 14, 14]          118,272                   363,113,472
│    └─InvertedResidual: 2-14                      [16, 96, 14, 14]          [16, 96, 14, 14]          --                        --
│    │    └─Sequential: 3-16                       [16, 96, 14, 14]          [16, 96, 14, 14]          118,272                   363,113,472
│    └─InvertedResidual: 2-15                      [16, 96, 14, 14]          [16, 160, 7, 7]           --                        --
│    │    └─Sequential: 3-17                       [16, 96, 14, 14]          [16, 160, 7, 7]           155,264                   249,767,936
│    └─InvertedResidual: 2-16                      [16, 160, 7, 7]           [16, 160, 7, 7]           --                        --
│    │    └─Sequential: 3-18                       [16, 160, 7, 7]           [16, 160, 7, 7]           320,000                   247,685,120
│    └─InvertedResidual: 2-17                      [16, 160, 7, 7]           [16, 160, 7, 7]           --                        --
│    │    └─Sequential: 3-19                       [16, 160, 7, 7]           [16, 160, 7, 7]           320,000                   247,685,120
│    └─InvertedResidual: 2-18                      [16, 160, 7, 7]           [16, 320, 7, 7]           --                        --
│    │    └─Sequential: 3-20                       [16, 160, 7, 7]           [16, 320, 7, 7]           473,920                   368,112,640
│    └─Conv2dNormActivation: 2-19                  [16, 320, 7, 7]           [16, 1280, 7, 7]          --                        --
│    │    └─Conv2d: 3-21                           [16, 320, 7, 7]           [16, 1280, 7, 7]          409,600                   321,126,400
│    │    └─BatchNorm2d: 3-22                      [16, 1280, 7, 7]          [16, 1280, 7, 7]          2,560                     40,960
│    │    └─ReLU6: 3-23                            [16, 1280, 7, 7]          [16, 1280, 7, 7]          --                        --
├─Sequential: 1-2                                  [16, 1280]                [16, 1000]                --                        --
│    └─Dropout: 2-20                               [16, 1280]                [16, 1280]                --                        --
│    └─Linear: 2-21                                [16, 1280]                [16, 1000]                1,281,000                 20,496,000
======================================================================================================================================================
Total params: 3,504,872
Trainable params: 3,504,872
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 4.81
======================================================================================================================================================
Input size (MB): 9.63
Forward/backward pass size (MB): 1709.72
Params size (MB): 14.02
Estimated Total Size (MB): 1733.38
======================================================================================================================================================