======================================================================================================================================================
Layer (type:depth-idx)                             Input Shape               Output Shape              Param #                   Mult-Adds
======================================================================================================================================================
MobileNetV2                                        [64, 3, 224, 224]         [64, 1000]                --                        --
├─Sequential: 1-1                                  [64, 3, 224, 224]         [64, 1280, 7, 7]          --                        --
│    └─Conv2dNormActivation: 2-1                   [64, 3, 224, 224]         [64, 32, 112, 112]        --                        --
│    │    └─Conv2d: 3-1                            [64, 3, 224, 224]         [64, 32, 112, 112]        864                       693,633,024
│    │    └─BatchNorm2d: 3-2                       [64, 32, 112, 112]        [64, 32, 112, 112]        64                        4,096
│    │    └─ReLU6: 3-3                             [64, 32, 112, 112]        [64, 32, 112, 112]        --                        --
│    └─InvertedResidual: 2-2                       [64, 32, 112, 112]        [64, 16, 112, 112]        --                        --
│    │    └─Sequential: 3-4                        [64, 32, 112, 112]        [64, 16, 112, 112]        896                       642,258,944
│    └─InvertedResidual: 2-3                       [64, 16, 112, 112]        [64, 24, 56, 56]          --                        --
│    │    └─Sequential: 3-5                        [64, 16, 112, 112]        [64, 24, 56, 56]          5,136                     1,868,983,296
│    └─InvertedResidual: 2-4                       [64, 24, 56, 56]          [64, 24, 56, 56]          --                        --
│    │    └─Sequential: 3-6                        [64, 24, 56, 56]          [64, 24, 56, 56]          8,832                     1,647,418,368
│    └─InvertedResidual: 2-5                       [64, 24, 56, 56]          [64, 32, 28, 28]          --                        --
│    │    └─Sequential: 3-7                        [64, 24, 56, 56]          [64, 32, 28, 28]          10,000                    989,913,088
│    └─InvertedResidual: 2-6                       [64, 32, 28, 28]          [64, 32, 28, 28]          --                        --
│    │    └─Sequential: 3-8                        [64, 32, 28, 28]          [64, 32, 28, 28]          14,848                    703,320,064
│    └─InvertedResidual: 2-7                       [64, 32, 28, 28]          [64, 32, 28, 28]          --                        --
│    │    └─Sequential: 3-9                        [64, 32, 28, 28]          [64, 32, 28, 28]          14,848                    703,320,064
│    └─InvertedResidual: 2-8                       [64, 32, 28, 28]          [64, 64, 14, 14]          --                        --
│    │    └─Sequential: 3-10                       [64, 32, 28, 28]          [64, 64, 14, 14]          21,056                    484,155,392
│    └─InvertedResidual: 2-9                       [64, 64, 14, 14]          [64, 64, 14, 14]          --                        --
│    │    └─Sequential: 3-11                       [64, 64, 14, 14]          [64, 64, 14, 14]          54,272                    660,021,248
│    └─InvertedResidual: 2-10                      [64, 64, 14, 14]          [64, 64, 14, 14]          --                        --
│    │    └─Sequential: 3-12                       [64, 64, 14, 14]          [64, 64, 14, 14]          54,272                    660,021,248
│    └─InvertedResidual: 2-11                      [64, 64, 14, 14]          [64, 64, 14, 14]          --                        --
│    │    └─Sequential: 3-13                       [64, 64, 14, 14]          [64, 64, 14, 14]          54,272                    660,021,248
│    └─InvertedResidual: 2-12                      [64, 64, 14, 14]          [64, 96, 14, 14]          --                        --
│    │    └─Sequential: 3-14                       [64, 64, 14, 14]          [64, 96, 14, 14]          66,624                    814,166,016
│    └─InvertedResidual: 2-13                      [64, 96, 14, 14]          [64, 96, 14, 14]          --                        --
│    │    └─Sequential: 3-15                       [64, 96, 14, 14]          [64, 96, 14, 14]          118,272                   1,452,453,888
│    └─InvertedResidual: 2-14                      [64, 96, 14, 14]          [64, 96, 14, 14]          --                        --
│    │    └─Sequential: 3-16                       [64, 96, 14, 14]          [64, 96, 14, 14]          118,272                   1,452,453,888
│    └─InvertedResidual: 2-15                      [64, 96, 14, 14]          [64, 160, 7, 7]           --                        --
│    │    └─Sequential: 3-17                       [64, 96, 14, 14]          [64, 160, 7, 7]           155,264                   999,071,744
│    └─InvertedResidual: 2-16                      [64, 160, 7, 7]           [64, 160, 7, 7]           --                        --
│    │    └─Sequential: 3-18                       [64, 160, 7, 7]           [64, 160, 7, 7]           320,000                   990,740,480
│    └─InvertedResidual: 2-17                      [64, 160, 7, 7]           [64, 160, 7, 7]           --                        --
│    │    └─Sequential: 3-19                       [64, 160, 7, 7]           [64, 160, 7, 7]           320,000                   990,740,480
│    └─InvertedResidual: 2-18                      [64, 160, 7, 7]           [64, 320, 7, 7]           --                        --
│    │    └─Sequential: 3-20                       [64, 160, 7, 7]           [64, 320, 7, 7]           473,920                   1,472,450,560
│    └─Conv2dNormActivation: 2-19                  [64, 320, 7, 7]           [64, 1280, 7, 7]          --                        --
│    │    └─Conv2d: 3-21                           [64, 320, 7, 7]           [64, 1280, 7, 7]          409,600                   1,284,505,600
│    │    └─BatchNorm2d: 3-22                      [64, 1280, 7, 7]          [64, 1280, 7, 7]          2,560                     163,840
│    │    └─ReLU6: 3-23                            [64, 1280, 7, 7]          [64, 1280, 7, 7]          --                        --
├─Sequential: 1-2                                  [64, 1280]                [64, 1000]                --                        --
│    └─Dropout: 2-20                               [64, 1280]                [64, 1280]                --                        --
│    └─Linear: 2-21                                [64, 1280]                [64, 1000]                1,281,000                 81,984,000
======================================================================================================================================================
Total params: 3,504,872
Trainable params: 3,504,872
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 19.25
======================================================================================================================================================
Input size (MB): 38.54
Forward/backward pass size (MB): 6838.90
Params size (MB): 14.02
Estimated Total Size (MB): 6891.45
======================================================================================================================================================