======================================================================================================================================================
Layer (type:depth-idx)                             Input Shape               Output Shape              Param #                   Mult-Adds
======================================================================================================================================================
MobileNetV2                                        [256, 3, 224, 224]        [256, 1000]               --                        --
├─Sequential: 1-1                                  [256, 3, 224, 224]        [256, 1280, 7, 7]         --                        --
│    └─Conv2dNormActivation: 2-1                   [256, 3, 224, 224]        [256, 32, 112, 112]       --                        --
│    │    └─Conv2d: 3-1                            [256, 3, 224, 224]        [256, 32, 112, 112]       864                       2,774,532,096
│    │    └─BatchNorm2d: 3-2                       [256, 32, 112, 112]       [256, 32, 112, 112]       64                        16,384
│    │    └─ReLU6: 3-3                             [256, 32, 112, 112]       [256, 32, 112, 112]       --                        --
│    └─InvertedResidual: 2-2                       [256, 32, 112, 112]       [256, 16, 112, 112]       --                        --
│    │    └─Sequential: 3-4                        [256, 32, 112, 112]       [256, 16, 112, 112]       896                       2,569,035,776
│    └─InvertedResidual: 2-3                       [256, 16, 112, 112]       [256, 24, 56, 56]         --                        --
│    │    └─Sequential: 3-5                        [256, 16, 112, 112]       [256, 24, 56, 56]         5,136                     7,475,933,184
│    └─InvertedResidual: 2-4                       [256, 24, 56, 56]         [256, 24, 56, 56]         --                        --
│    │    └─Sequential: 3-6                        [256, 24, 56, 56]         [256, 24, 56, 56]         8,832                     6,589,673,472
│    └─InvertedResidual: 2-5                       [256, 24, 56, 56]         [256, 32, 28, 28]         --                        --
│    │    └─Sequential: 3-7                        [256, 24, 56, 56]         [256, 32, 28, 28]         10,000                    3,959,652,352
│    └─InvertedResidual: 2-6                       [256, 32, 28, 28]         [256, 32, 28, 28]         --                        --
│    │    └─Sequential: 3-8                        [256, 32, 28, 28]         [256, 32, 28, 28]         14,848                    2,813,280,256
│    └─InvertedResidual: 2-7                       [256, 32, 28, 28]         [256, 32, 28, 28]         --                        --
│    │    └─Sequential: 3-9                        [256, 32, 28, 28]         [256, 32, 28, 28]         14,848                    2,813,280,256
│    └─InvertedResidual: 2-8                       [256, 32, 28, 28]         [256, 64, 14, 14]         --                        --
│    │    └─Sequential: 3-10                       [256, 32, 28, 28]         [256, 64, 14, 14]         21,056                    1,936,621,568
│    └─InvertedResidual: 2-9                       [256, 64, 14, 14]         [256, 64, 14, 14]         --                        --
│    │    └─Sequential: 3-11                       [256, 64, 14, 14]         [256, 64, 14, 14]         54,272                    2,640,084,992
│    └─InvertedResidual: 2-10                      [256, 64, 14, 14]         [256, 64, 14, 14]         --                        --
│    │    └─Sequential: 3-12                       [256, 64, 14, 14]         [256, 64, 14, 14]         54,272                    2,640,084,992
│    └─InvertedResidual: 2-11                      [256, 64, 14, 14]         [256, 64, 14, 14]         --                        --
│    │    └─Sequential: 3-13                       [256, 64, 14, 14]         [256, 64, 14, 14]         54,272                    2,640,084,992
│    └─InvertedResidual: 2-12                      [256, 64, 14, 14]         [256, 96, 14, 14]         --                        --
│    │    └─Sequential: 3-14                       [256, 64, 14, 14]         [256, 96, 14, 14]         66,624                    3,256,664,064
│    └─InvertedResidual: 2-13                      [256, 96, 14, 14]         [256, 96, 14, 14]         --                        --
│    │    └─Sequential: 3-15                       [256, 96, 14, 14]         [256, 96, 14, 14]         118,272                   5,809,815,552
│    └─InvertedResidual: 2-14                      [256, 96, 14, 14]         [256, 96, 14, 14]         --                        --
│    │    └─Sequential: 3-16                       [256, 96, 14, 14]         [256, 96, 14, 14]         118,272                   5,809,815,552
│    └─InvertedResidual: 2-15                      [256, 96, 14, 14]         [256, 160, 7, 7]          --                        --
│    │    └─Sequential: 3-17                       [256, 96, 14, 14]         [256, 160, 7, 7]          155,264                   3,996,286,976
│    └─InvertedResidual: 2-16                      [256, 160, 7, 7]          [256, 160, 7, 7]          --                        --
│    │    └─Sequential: 3-18                       [256, 160, 7, 7]          [256, 160, 7, 7]          320,000                   3,962,961,920
│    └─InvertedResidual: 2-17                      [256, 160, 7, 7]          [256, 160, 7, 7]          --                        --
│    │    └─Sequential: 3-19                       [256, 160, 7, 7]          [256, 160, 7, 7]          320,000                   3,962,961,920
│    └─InvertedResidual: 2-18                      [256, 160, 7, 7]          [256, 320, 7, 7]          --                        --
│    │    └─Sequential: 3-20                       [256, 160, 7, 7]          [256, 320, 7, 7]          473,920                   5,889,802,240
│    └─Conv2dNormActivation: 2-19                  [256, 320, 7, 7]          [256, 1280, 7, 7]         --                        --
│    │    └─Conv2d: 3-21                           [256, 320, 7, 7]          [256, 1280, 7, 7]         409,600                   5,138,022,400
│    │    └─BatchNorm2d: 3-22                      [256, 1280, 7, 7]         [256, 1280, 7, 7]         2,560                     655,360
│    │    └─ReLU6: 3-23                            [256, 1280, 7, 7]         [256, 1280, 7, 7]         --                        --
├─Sequential: 1-2                                  [256, 1280]               [256, 1000]               --                        --
│    └─Dropout: 2-20                               [256, 1280]               [256, 1280]               --                        --
│    └─Linear: 2-21                                [256, 1280]               [256, 1000]               1,281,000                 327,936,000
======================================================================================================================================================
Total params: 3,504,872
Trainable params: 3,504,872
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 77.01
======================================================================================================================================================
Input size (MB): 154.14
Forward/backward pass size (MB): 27355.59
Params size (MB): 14.02
Estimated Total Size (MB): 27523.75
======================================================================================================================================================