============================================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Param #                   Mult-Adds
============================================================================================================================================
ResNet                                   [128, 3, 224, 224]        [128, 1000]               --                        --
├─Conv2d: 1-1                            [128, 3, 224, 224]        [128, 64, 112, 112]       9,408                     15,105,785,856
├─BatchNorm2d: 1-2                       [128, 64, 112, 112]       [128, 64, 112, 112]       128                       16,384
├─ReLU: 1-3                              [128, 64, 112, 112]       [128, 64, 112, 112]       --                        --
├─MaxPool2d: 1-4                         [128, 64, 112, 112]       [128, 64, 56, 56]         --                        --
├─Sequential: 1-5                        [128, 64, 56, 56]         [128, 256, 56, 56]        --                        --
│    └─Bottleneck: 2-1                   [128, 64, 56, 56]         [128, 256, 56, 56]        --                        --
│    │    └─Conv2d: 3-1                  [128, 64, 56, 56]         [128, 64, 56, 56]         4,096                     1,644,167,168
│    │    └─BatchNorm2d: 3-2             [128, 64, 56, 56]         [128, 64, 56, 56]         128                       16,384
│    │    └─ReLU: 3-3                    [128, 64, 56, 56]         [128, 64, 56, 56]         --                        --
│    │    └─Conv2d: 3-4                  [128, 64, 56, 56]         [128, 64, 56, 56]         36,864                    14,797,504,512
│    │    └─BatchNorm2d: 3-5             [128, 64, 56, 56]         [128, 64, 56, 56]         128                       16,384
│    │    └─ReLU: 3-6                    [128, 64, 56, 56]         [128, 64, 56, 56]         --                        --
│    │    └─Conv2d: 3-7                  [128, 64, 56, 56]         [128, 256, 56, 56]        16,384                    6,576,668,672
│    │    └─BatchNorm2d: 3-8             [128, 256, 56, 56]        [128, 256, 56, 56]        512                       65,536
│    │    └─Sequential: 3-9              [128, 64, 56, 56]         [128, 256, 56, 56]        16,896                    6,576,734,208
│    │    └─ReLU: 3-10                   [128, 256, 56, 56]        [128, 256, 56, 56]        --                        --
│    └─Bottleneck: 2-2                   [128, 256, 56, 56]        [128, 256, 56, 56]        --                        --
│    │    └─Conv2d: 3-11                 [128, 256, 56, 56]        [128, 64, 56, 56]         16,384                    6,576,668,672
│    │    └─BatchNorm2d: 3-12            [128, 64, 56, 56]         [128, 64, 56, 56]         128                       16,384
│    │    └─ReLU: 3-13                   [128, 64, 56, 56]         [128, 64, 56, 56]         --                        --
│    │    └─Conv2d: 3-14                 [128, 64, 56, 56]         [128, 64, 56, 56]         36,864                    14,797,504,512
│    │    └─BatchNorm2d: 3-15            [128, 64, 56, 56]         [128, 64, 56, 56]         128                       16,384
│    │    └─ReLU: 3-16                   [128, 64, 56, 56]         [128, 64, 56, 56]         --                        --
│    │    └─Conv2d: 3-17                 [128, 64, 56, 56]         [128, 256, 56, 56]        16,384                    6,576,668,672
│    │    └─BatchNorm2d: 3-18            [128, 256, 56, 56]        [128, 256, 56, 56]        512                       65,536
│    │    └─ReLU: 3-19                   [128, 256, 56, 56]        [128, 256, 56, 56]        --                        --
│    └─Bottleneck: 2-3                   [128, 256, 56, 56]        [128, 256, 56, 56]        --                        --
│    │    └─Conv2d: 3-20                 [128, 256, 56, 56]        [128, 64, 56, 56]         16,384                    6,576,668,672
│    │    └─BatchNorm2d: 3-21            [128, 64, 56, 56]         [128, 64, 56, 56]         128                       16,384
│    │    └─ReLU: 3-22                   [128, 64, 56, 56]         [128, 64, 56, 56]         --                        --
│    │    └─Conv2d: 3-23                 [128, 64, 56, 56]         [128, 64, 56, 56]         36,864                    14,797,504,512
│    │    └─BatchNorm2d: 3-24            [128, 64, 56, 56]         [128, 64, 56, 56]         128                       16,384
│    │    └─ReLU: 3-25                   [128, 64, 56, 56]         [128, 64, 56, 56]         --                        --
│    │    └─Conv2d: 3-26                 [128, 64, 56, 56]         [128, 256, 56, 56]        16,384                    6,576,668,672
│    │    └─BatchNorm2d: 3-27            [128, 256, 56, 56]        [128, 256, 56, 56]        512                       65,536
│    │    └─ReLU: 3-28                   [128, 256, 56, 56]        [128, 256, 56, 56]        --                        --
├─Sequential: 1-6                        [128, 256, 56, 56]        [128, 512, 28, 28]        --                        --
│    └─Bottleneck: 2-4                   [128, 256, 56, 56]        [128, 512, 28, 28]        --                        --
│    │    └─Conv2d: 3-29                 [128, 256, 56, 56]        [128, 128, 56, 56]        32,768                    13,153,337,344
│    │    └─BatchNorm2d: 3-30            [128, 128, 56, 56]        [128, 128, 56, 56]        256                       32,768
│    │    └─ReLU: 3-31                   [128, 128, 56, 56]        [128, 128, 56, 56]        --                        --
│    │    └─Conv2d: 3-32                 [128, 128, 56, 56]        [128, 128, 28, 28]        147,456                   14,797,504,512
│    │    └─BatchNorm2d: 3-33            [128, 128, 28, 28]        [128, 128, 28, 28]        256                       32,768
│    │    └─ReLU: 3-34                   [128, 128, 28, 28]        [128, 128, 28, 28]        --                        --
│    │    └─Conv2d: 3-35                 [128, 128, 28, 28]        [128, 512, 28, 28]        65,536                    6,576,668,672
│    │    └─BatchNorm2d: 3-36            [128, 512, 28, 28]        [128, 512, 28, 28]        1,024                     131,072
│    │    └─Sequential: 3-37             [128, 256, 56, 56]        [128, 512, 28, 28]        132,096                   13,153,468,416
│    │    └─ReLU: 3-38                   [128, 512, 28, 28]        [128, 512, 28, 28]        --                        --
│    └─Bottleneck: 2-5                   [128, 512, 28, 28]        [128, 512, 28, 28]        --                        --
│    │    └─Conv2d: 3-39                 [128, 512, 28, 28]        [128, 128, 28, 28]        65,536                    6,576,668,672
│    │    └─BatchNorm2d: 3-40            [128, 128, 28, 28]        [128, 128, 28, 28]        256                       32,768
│    │    └─ReLU: 3-41                   [128, 128, 28, 28]        [128, 128, 28, 28]        --                        --
│    │    └─Conv2d: 3-42                 [128, 128, 28, 28]        [128, 128, 28, 28]        147,456                   14,797,504,512
│    │    └─BatchNorm2d: 3-43            [128, 128, 28, 28]        [128, 128, 28, 28]        256                       32,768
│    │    └─ReLU: 3-44                   [128, 128, 28, 28]        [128, 128, 28, 28]        --                        --
│    │    └─Conv2d: 3-45                 [128, 128, 28, 28]        [128, 512, 28, 28]        65,536                    6,576,668,672
│    │    └─BatchNorm2d: 3-46            [128, 512, 28, 28]        [128, 512, 28, 28]        1,024                     131,072
│    │    └─ReLU: 3-47                   [128, 512, 28, 28]        [128, 512, 28, 28]        --                        --
│    └─Bottleneck: 2-6                   [128, 512, 28, 28]        [128, 512, 28, 28]        --                        --
│    │    └─Conv2d: 3-48                 [128, 512, 28, 28]        [128, 128, 28, 28]        65,536                    6,576,668,672
│    │    └─BatchNorm2d: 3-49            [128, 128, 28, 28]        [128, 128, 28, 28]        256                       32,768
│    │    └─ReLU: 3-50                   [128, 128, 28, 28]        [128, 128, 28, 28]        --                        --
│    │    └─Conv2d: 3-51                 [128, 128, 28, 28]        [128, 128, 28, 28]        147,456                   14,797,504,512
│    │    └─BatchNorm2d: 3-52            [128, 128, 28, 28]        [128, 128, 28, 28]        256                       32,768
│    │    └─ReLU: 3-53                   [128, 128, 28, 28]        [128, 128, 28, 28]        --                        --
│    │    └─Conv2d: 3-54                 [128, 128, 28, 28]        [128, 512, 28, 28]        65,536                    6,576,668,672
│    │    └─BatchNorm2d: 3-55            [128, 512, 28, 28]        [128, 512, 28, 28]        1,024                     131,072
│    │    └─ReLU: 3-56                   [128, 512, 28, 28]        [128, 512, 28, 28]        --                        --
│    └─Bottleneck: 2-7                   [128, 512, 28, 28]        [128, 512, 28, 28]        --                        --
│    │    └─Conv2d: 3-57                 [128, 512, 28, 28]        [128, 128, 28, 28]        65,536                    6,576,668,672
│    │    └─BatchNorm2d: 3-58            [128, 128, 28, 28]        [128, 128, 28, 28]        256                       32,768
│    │    └─ReLU: 3-59                   [128, 128, 28, 28]        [128, 128, 28, 28]        --                        --
│    │    └─Conv2d: 3-60                 [128, 128, 28, 28]        [128, 128, 28, 28]        147,456                   14,797,504,512
│    │    └─BatchNorm2d: 3-61            [128, 128, 28, 28]        [128, 128, 28, 28]        256                       32,768
│    │    └─ReLU: 3-62                   [128, 128, 28, 28]        [128, 128, 28, 28]        --                        --
│    │    └─Conv2d: 3-63                 [128, 128, 28, 28]        [128, 512, 28, 28]        65,536                    6,576,668,672
│    │    └─BatchNorm2d: 3-64            [128, 512, 28, 28]        [128, 512, 28, 28]        1,024                     131,072
│    │    └─ReLU: 3-65                   [128, 512, 28, 28]        [128, 512, 28, 28]        --                        --
├─Sequential: 1-7                        [128, 512, 28, 28]        [128, 1024, 14, 14]       --                        --
│    └─Bottleneck: 2-8                   [128, 512, 28, 28]        [128, 1024, 14, 14]       --                        --
│    │    └─Conv2d: 3-66                 [128, 512, 28, 28]        [128, 256, 28, 28]        131,072                   13,153,337,344
│    │    └─BatchNorm2d: 3-67            [128, 256, 28, 28]        [128, 256, 28, 28]        512                       65,536
│    │    └─ReLU: 3-68                   [128, 256, 28, 28]        [128, 256, 28, 28]        --                        --
│    │    └─Conv2d: 3-69                 [128, 256, 28, 28]        [128, 256, 14, 14]        589,824                   14,797,504,512
│    │    └─BatchNorm2d: 3-70            [128, 256, 14, 14]        [128, 256, 14, 14]        512                       65,536
│    │    └─ReLU: 3-71                   [128, 256, 14, 14]        [128, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-72                 [128, 256, 14, 14]        [128, 1024, 14, 14]       262,144                   6,576,668,672
│    │    └─BatchNorm2d: 3-73            [128, 1024, 14, 14]       [128, 1024, 14, 14]       2,048                     262,144
│    │    └─Sequential: 3-74             [128, 512, 28, 28]        [128, 1024, 14, 14]       526,336                   13,153,599,488
│    │    └─ReLU: 3-75                   [128, 1024, 14, 14]       [128, 1024, 14, 14]       --                        --
│    └─Bottleneck: 2-9                   [128, 1024, 14, 14]       [128, 1024, 14, 14]       --                        --
│    │    └─Conv2d: 3-76                 [128, 1024, 14, 14]       [128, 256, 14, 14]        262,144                   6,576,668,672
│    │    └─BatchNorm2d: 3-77            [128, 256, 14, 14]        [128, 256, 14, 14]        512                       65,536
│    │    └─ReLU: 3-78                   [128, 256, 14, 14]        [128, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-79                 [128, 256, 14, 14]        [128, 256, 14, 14]        589,824                   14,797,504,512
│    │    └─BatchNorm2d: 3-80            [128, 256, 14, 14]        [128, 256, 14, 14]        512                       65,536
│    │    └─ReLU: 3-81                   [128, 256, 14, 14]        [128, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-82                 [128, 256, 14, 14]        [128, 1024, 14, 14]       262,144                   6,576,668,672
│    │    └─BatchNorm2d: 3-83            [128, 1024, 14, 14]       [128, 1024, 14, 14]       2,048                     262,144
│    │    └─ReLU: 3-84                   [128, 1024, 14, 14]       [128, 1024, 14, 14]       --                        --
│    └─Bottleneck: 2-10                  [128, 1024, 14, 14]       [128, 1024, 14, 14]       --                        --
│    │    └─Conv2d: 3-85                 [128, 1024, 14, 14]       [128, 256, 14, 14]        262,144                   6,576,668,672
│    │    └─BatchNorm2d: 3-86            [128, 256, 14, 14]        [128, 256, 14, 14]        512                       65,536
│    │    └─ReLU: 3-87                   [128, 256, 14, 14]        [128, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-88                 [128, 256, 14, 14]        [128, 256, 14, 14]        589,824                   14,797,504,512
│    │    └─BatchNorm2d: 3-89            [128, 256, 14, 14]        [128, 256, 14, 14]        512                       65,536
│    │    └─ReLU: 3-90                   [128, 256, 14, 14]        [128, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-91                 [128, 256, 14, 14]        [128, 1024, 14, 14]       262,144                   6,576,668,672
│    │    └─BatchNorm2d: 3-92            [128, 1024, 14, 14]       [128, 1024, 14, 14]       2,048                     262,144
│    │    └─ReLU: 3-93                   [128, 1024, 14, 14]       [128, 1024, 14, 14]       --                        --
│    └─Bottleneck: 2-11                  [128, 1024, 14, 14]       [128, 1024, 14, 14]       --                        --
│    │    └─Conv2d: 3-94                 [128, 1024, 14, 14]       [128, 256, 14, 14]        262,144                   6,576,668,672
│    │    └─BatchNorm2d: 3-95            [128, 256, 14, 14]        [128, 256, 14, 14]        512                       65,536
│    │    └─ReLU: 3-96                   [128, 256, 14, 14]        [128, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-97                 [128, 256, 14, 14]        [128, 256, 14, 14]        589,824                   14,797,504,512
│    │    └─BatchNorm2d: 3-98            [128, 256, 14, 14]        [128, 256, 14, 14]        512                       65,536
│    │    └─ReLU: 3-99                   [128, 256, 14, 14]        [128, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-100                [128, 256, 14, 14]        [128, 1024, 14, 14]       262,144                   6,576,668,672
│    │    └─BatchNorm2d: 3-101           [128, 1024, 14, 14]       [128, 1024, 14, 14]       2,048                     262,144
│    │    └─ReLU: 3-102                  [128, 1024, 14, 14]       [128, 1024, 14, 14]       --                        --
│    └─Bottleneck: 2-12                  [128, 1024, 14, 14]       [128, 1024, 14, 14]       --                        --
│    │    └─Conv2d: 3-103                [128, 1024, 14, 14]       [128, 256, 14, 14]        262,144                   6,576,668,672
│    │    └─BatchNorm2d: 3-104           [128, 256, 14, 14]        [128, 256, 14, 14]        512                       65,536
│    │    └─ReLU: 3-105                  [128, 256, 14, 14]        [128, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-106                [128, 256, 14, 14]        [128, 256, 14, 14]        589,824                   14,797,504,512
│    │    └─BatchNorm2d: 3-107           [128, 256, 14, 14]        [128, 256, 14, 14]        512                       65,536
│    │    └─ReLU: 3-108                  [128, 256, 14, 14]        [128, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-109                [128, 256, 14, 14]        [128, 1024, 14, 14]       262,144                   6,576,668,672
│    │    └─BatchNorm2d: 3-110           [128, 1024, 14, 14]       [128, 1024, 14, 14]       2,048                     262,144
│    │    └─ReLU: 3-111                  [128, 1024, 14, 14]       [128, 1024, 14, 14]       --                        --
│    └─Bottleneck: 2-13                  [128, 1024, 14, 14]       [128, 1024, 14, 14]       --                        --
│    │    └─Conv2d: 3-112                [128, 1024, 14, 14]       [128, 256, 14, 14]        262,144                   6,576,668,672
│    │    └─BatchNorm2d: 3-113           [128, 256, 14, 14]        [128, 256, 14, 14]        512                       65,536
│    │    └─ReLU: 3-114                  [128, 256, 14, 14]        [128, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-115                [128, 256, 14, 14]        [128, 256, 14, 14]        589,824                   14,797,504,512
│    │    └─BatchNorm2d: 3-116           [128, 256, 14, 14]        [128, 256, 14, 14]        512                       65,536
│    │    └─ReLU: 3-117                  [128, 256, 14, 14]        [128, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-118                [128, 256, 14, 14]        [128, 1024, 14, 14]       262,144                   6,576,668,672
│    │    └─BatchNorm2d: 3-119           [128, 1024, 14, 14]       [128, 1024, 14, 14]       2,048                     262,144
│    │    └─ReLU: 3-120                  [128, 1024, 14, 14]       [128, 1024, 14, 14]       --                        --
├─Sequential: 1-8                        [128, 1024, 14, 14]       [128, 2048, 7, 7]         --                        --
│    └─Bottleneck: 2-14                  [128, 1024, 14, 14]       [128, 2048, 7, 7]         --                        --
│    │    └─Conv2d: 3-121                [128, 1024, 14, 14]       [128, 512, 14, 14]        524,288                   13,153,337,344
│    │    └─BatchNorm2d: 3-122           [128, 512, 14, 14]        [128, 512, 14, 14]        1,024                     131,072
│    │    └─ReLU: 3-123                  [128, 512, 14, 14]        [128, 512, 14, 14]        --                        --
│    │    └─Conv2d: 3-124                [128, 512, 14, 14]        [128, 512, 7, 7]          2,359,296                 14,797,504,512
│    │    └─BatchNorm2d: 3-125           [128, 512, 7, 7]          [128, 512, 7, 7]          1,024                     131,072
│    │    └─ReLU: 3-126                  [128, 512, 7, 7]          [128, 512, 7, 7]          --                        --
│    │    └─Conv2d: 3-127                [128, 512, 7, 7]          [128, 2048, 7, 7]         1,048,576                 6,576,668,672
│    │    └─BatchNorm2d: 3-128           [128, 2048, 7, 7]         [128, 2048, 7, 7]         4,096                     524,288
│    │    └─Sequential: 3-129            [128, 1024, 14, 14]       [128, 2048, 7, 7]         2,101,248                 13,153,861,632
│    │    └─ReLU: 3-130                  [128, 2048, 7, 7]         [128, 2048, 7, 7]         --                        --
│    └─Bottleneck: 2-15                  [128, 2048, 7, 7]         [128, 2048, 7, 7]         --                        --
│    │    └─Conv2d: 3-131                [128, 2048, 7, 7]         [128, 512, 7, 7]          1,048,576                 6,576,668,672
│    │    └─BatchNorm2d: 3-132           [128, 512, 7, 7]          [128, 512, 7, 7]          1,024                     131,072
│    │    └─ReLU: 3-133                  [128, 512, 7, 7]          [128, 512, 7, 7]          --                        --
│    │    └─Conv2d: 3-134                [128, 512, 7, 7]          [128, 512, 7, 7]          2,359,296                 14,797,504,512
│    │    └─BatchNorm2d: 3-135           [128, 512, 7, 7]          [128, 512, 7, 7]          1,024                     131,072
│    │    └─ReLU: 3-136                  [128, 512, 7, 7]          [128, 512, 7, 7]          --                        --
│    │    └─Conv2d: 3-137                [128, 512, 7, 7]          [128, 2048, 7, 7]         1,048,576                 6,576,668,672
│    │    └─BatchNorm2d: 3-138           [128, 2048, 7, 7]         [128, 2048, 7, 7]         4,096                     524,288
│    │    └─ReLU: 3-139                  [128, 2048, 7, 7]         [128, 2048, 7, 7]         --                        --
│    └─Bottleneck: 2-16                  [128, 2048, 7, 7]         [128, 2048, 7, 7]         --                        --
│    │    └─Conv2d: 3-140                [128, 2048, 7, 7]         [128, 512, 7, 7]          1,048,576                 6,576,668,672
│    │    └─BatchNorm2d: 3-141           [128, 512, 7, 7]          [128, 512, 7, 7]          1,024                     131,072
│    │    └─ReLU: 3-142                  [128, 512, 7, 7]          [128, 512, 7, 7]          --                        --
│    │    └─Conv2d: 3-143                [128, 512, 7, 7]          [128, 512, 7, 7]          2,359,296                 14,797,504,512
│    │    └─BatchNorm2d: 3-144           [128, 512, 7, 7]          [128, 512, 7, 7]          1,024                     131,072
│    │    └─ReLU: 3-145                  [128, 512, 7, 7]          [128, 512, 7, 7]          --                        --
│    │    └─Conv2d: 3-146                [128, 512, 7, 7]          [128, 2048, 7, 7]         1,048,576                 6,576,668,672
│    │    └─BatchNorm2d: 3-147           [128, 2048, 7, 7]         [128, 2048, 7, 7]         4,096                     524,288
│    │    └─ReLU: 3-148                  [128, 2048, 7, 7]         [128, 2048, 7, 7]         --                        --
├─AdaptiveAvgPool2d: 1-9                 [128, 2048, 7, 7]         [128, 2048, 1, 1]         --                        --
├─Linear: 1-10                           [128, 2048]               [128, 1000]               2,049,000                 262,272,000
============================================================================================================================================
Total params: 25,557,032
Trainable params: 25,557,032
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 523.42
============================================================================================================================================
Input size (MB): 77.07
Forward/backward pass size (MB): 22762.46
Params size (MB): 102.23
Estimated Total Size (MB): 22941.76
============================================================================================================================================