============================================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Param #                   Mult-Adds
============================================================================================================================================
ResNet                                   [256, 3, 224, 224]        [256, 1000]               --                        --
├─Conv2d: 1-1                            [256, 3, 224, 224]        [256, 64, 112, 112]       9,408                     30,211,571,712
├─BatchNorm2d: 1-2                       [256, 64, 112, 112]       [256, 64, 112, 112]       128                       32,768
├─ReLU: 1-3                              [256, 64, 112, 112]       [256, 64, 112, 112]       --                        --
├─MaxPool2d: 1-4                         [256, 64, 112, 112]       [256, 64, 56, 56]         --                        --
├─Sequential: 1-5                        [256, 64, 56, 56]         [256, 256, 56, 56]        --                        --
│    └─Bottleneck: 2-1                   [256, 64, 56, 56]         [256, 256, 56, 56]        --                        --
│    │    └─Conv2d: 3-1                  [256, 64, 56, 56]         [256, 64, 56, 56]         4,096                     3,288,334,336
│    │    └─BatchNorm2d: 3-2             [256, 64, 56, 56]         [256, 64, 56, 56]         128                       32,768
│    │    └─ReLU: 3-3                    [256, 64, 56, 56]         [256, 64, 56, 56]         --                        --
│    │    └─Conv2d: 3-4                  [256, 64, 56, 56]         [256, 64, 56, 56]         36,864                    29,595,009,024
│    │    └─BatchNorm2d: 3-5             [256, 64, 56, 56]         [256, 64, 56, 56]         128                       32,768
│    │    └─ReLU: 3-6                    [256, 64, 56, 56]         [256, 64, 56, 56]         --                        --
│    │    └─Conv2d: 3-7                  [256, 64, 56, 56]         [256, 256, 56, 56]        16,384                    13,153,337,344
│    │    └─BatchNorm2d: 3-8             [256, 256, 56, 56]        [256, 256, 56, 56]        512                       131,072
│    │    └─Sequential: 3-9              [256, 64, 56, 56]         [256, 256, 56, 56]        16,896                    13,153,468,416
│    │    └─ReLU: 3-10                   [256, 256, 56, 56]        [256, 256, 56, 56]        --                        --
│    └─Bottleneck: 2-2                   [256, 256, 56, 56]        [256, 256, 56, 56]        --                        --
│    │    └─Conv2d: 3-11                 [256, 256, 56, 56]        [256, 64, 56, 56]         16,384                    13,153,337,344
│    │    └─BatchNorm2d: 3-12            [256, 64, 56, 56]         [256, 64, 56, 56]         128                       32,768
│    │    └─ReLU: 3-13                   [256, 64, 56, 56]         [256, 64, 56, 56]         --                        --
│    │    └─Conv2d: 3-14                 [256, 64, 56, 56]         [256, 64, 56, 56]         36,864                    29,595,009,024
│    │    └─BatchNorm2d: 3-15            [256, 64, 56, 56]         [256, 64, 56, 56]         128                       32,768
│    │    └─ReLU: 3-16                   [256, 64, 56, 56]         [256, 64, 56, 56]         --                        --
│    │    └─Conv2d: 3-17                 [256, 64, 56, 56]         [256, 256, 56, 56]        16,384                    13,153,337,344
│    │    └─BatchNorm2d: 3-18            [256, 256, 56, 56]        [256, 256, 56, 56]        512                       131,072
│    │    └─ReLU: 3-19                   [256, 256, 56, 56]        [256, 256, 56, 56]        --                        --
│    └─Bottleneck: 2-3                   [256, 256, 56, 56]        [256, 256, 56, 56]        --                        --
│    │    └─Conv2d: 3-20                 [256, 256, 56, 56]        [256, 64, 56, 56]         16,384                    13,153,337,344
│    │    └─BatchNorm2d: 3-21            [256, 64, 56, 56]         [256, 64, 56, 56]         128                       32,768
│    │    └─ReLU: 3-22                   [256, 64, 56, 56]         [256, 64, 56, 56]         --                        --
│    │    └─Conv2d: 3-23                 [256, 64, 56, 56]         [256, 64, 56, 56]         36,864                    29,595,009,024
│    │    └─BatchNorm2d: 3-24            [256, 64, 56, 56]         [256, 64, 56, 56]         128                       32,768
│    │    └─ReLU: 3-25                   [256, 64, 56, 56]         [256, 64, 56, 56]         --                        --
│    │    └─Conv2d: 3-26                 [256, 64, 56, 56]         [256, 256, 56, 56]        16,384                    13,153,337,344
│    │    └─BatchNorm2d: 3-27            [256, 256, 56, 56]        [256, 256, 56, 56]        512                       131,072
│    │    └─ReLU: 3-28                   [256, 256, 56, 56]        [256, 256, 56, 56]        --                        --
├─Sequential: 1-6                        [256, 256, 56, 56]        [256, 512, 28, 28]        --                        --
│    └─Bottleneck: 2-4                   [256, 256, 56, 56]        [256, 512, 28, 28]        --                        --
│    │    └─Conv2d: 3-29                 [256, 256, 56, 56]        [256, 128, 56, 56]        32,768                    26,306,674,688
│    │    └─BatchNorm2d: 3-30            [256, 128, 56, 56]        [256, 128, 56, 56]        256                       65,536
│    │    └─ReLU: 3-31                   [256, 128, 56, 56]        [256, 128, 56, 56]        --                        --
│    │    └─Conv2d: 3-32                 [256, 128, 56, 56]        [256, 128, 28, 28]        147,456                   29,595,009,024
│    │    └─BatchNorm2d: 3-33            [256, 128, 28, 28]        [256, 128, 28, 28]        256                       65,536
│    │    └─ReLU: 3-34                   [256, 128, 28, 28]        [256, 128, 28, 28]        --                        --
│    │    └─Conv2d: 3-35                 [256, 128, 28, 28]        [256, 512, 28, 28]        65,536                    13,153,337,344
│    │    └─BatchNorm2d: 3-36            [256, 512, 28, 28]        [256, 512, 28, 28]        1,024                     262,144
│    │    └─Sequential: 3-37             [256, 256, 56, 56]        [256, 512, 28, 28]        132,096                   26,306,936,832
│    │    └─ReLU: 3-38                   [256, 512, 28, 28]        [256, 512, 28, 28]        --                        --
│    └─Bottleneck: 2-5                   [256, 512, 28, 28]        [256, 512, 28, 28]        --                        --
│    │    └─Conv2d: 3-39                 [256, 512, 28, 28]        [256, 128, 28, 28]        65,536                    13,153,337,344
│    │    └─BatchNorm2d: 3-40            [256, 128, 28, 28]        [256, 128, 28, 28]        256                       65,536
│    │    └─ReLU: 3-41                   [256, 128, 28, 28]        [256, 128, 28, 28]        --                        --
│    │    └─Conv2d: 3-42                 [256, 128, 28, 28]        [256, 128, 28, 28]        147,456                   29,595,009,024
│    │    └─BatchNorm2d: 3-43            [256, 128, 28, 28]        [256, 128, 28, 28]        256                       65,536
│    │    └─ReLU: 3-44                   [256, 128, 28, 28]        [256, 128, 28, 28]        --                        --
│    │    └─Conv2d: 3-45                 [256, 128, 28, 28]        [256, 512, 28, 28]        65,536                    13,153,337,344
│    │    └─BatchNorm2d: 3-46            [256, 512, 28, 28]        [256, 512, 28, 28]        1,024                     262,144
│    │    └─ReLU: 3-47                   [256, 512, 28, 28]        [256, 512, 28, 28]        --                        --
│    └─Bottleneck: 2-6                   [256, 512, 28, 28]        [256, 512, 28, 28]        --                        --
│    │    └─Conv2d: 3-48                 [256, 512, 28, 28]        [256, 128, 28, 28]        65,536                    13,153,337,344
│    │    └─BatchNorm2d: 3-49            [256, 128, 28, 28]        [256, 128, 28, 28]        256                       65,536
│    │    └─ReLU: 3-50                   [256, 128, 28, 28]        [256, 128, 28, 28]        --                        --
│    │    └─Conv2d: 3-51                 [256, 128, 28, 28]        [256, 128, 28, 28]        147,456                   29,595,009,024
│    │    └─BatchNorm2d: 3-52            [256, 128, 28, 28]        [256, 128, 28, 28]        256                       65,536
│    │    └─ReLU: 3-53                   [256, 128, 28, 28]        [256, 128, 28, 28]        --                        --
│    │    └─Conv2d: 3-54                 [256, 128, 28, 28]        [256, 512, 28, 28]        65,536                    13,153,337,344
│    │    └─BatchNorm2d: 3-55            [256, 512, 28, 28]        [256, 512, 28, 28]        1,024                     262,144
│    │    └─ReLU: 3-56                   [256, 512, 28, 28]        [256, 512, 28, 28]        --                        --
│    └─Bottleneck: 2-7                   [256, 512, 28, 28]        [256, 512, 28, 28]        --                        --
│    │    └─Conv2d: 3-57                 [256, 512, 28, 28]        [256, 128, 28, 28]        65,536                    13,153,337,344
│    │    └─BatchNorm2d: 3-58            [256, 128, 28, 28]        [256, 128, 28, 28]        256                       65,536
│    │    └─ReLU: 3-59                   [256, 128, 28, 28]        [256, 128, 28, 28]        --                        --
│    │    └─Conv2d: 3-60                 [256, 128, 28, 28]        [256, 128, 28, 28]        147,456                   29,595,009,024
│    │    └─BatchNorm2d: 3-61            [256, 128, 28, 28]        [256, 128, 28, 28]        256                       65,536
│    │    └─ReLU: 3-62                   [256, 128, 28, 28]        [256, 128, 28, 28]        --                        --
│    │    └─Conv2d: 3-63                 [256, 128, 28, 28]        [256, 512, 28, 28]        65,536                    13,153,337,344
│    │    └─BatchNorm2d: 3-64            [256, 512, 28, 28]        [256, 512, 28, 28]        1,024                     262,144
│    │    └─ReLU: 3-65                   [256, 512, 28, 28]        [256, 512, 28, 28]        --                        --
├─Sequential: 1-7                        [256, 512, 28, 28]        [256, 1024, 14, 14]       --                        --
│    └─Bottleneck: 2-8                   [256, 512, 28, 28]        [256, 1024, 14, 14]       --                        --
│    │    └─Conv2d: 3-66                 [256, 512, 28, 28]        [256, 256, 28, 28]        131,072                   26,306,674,688
│    │    └─BatchNorm2d: 3-67            [256, 256, 28, 28]        [256, 256, 28, 28]        512                       131,072
│    │    └─ReLU: 3-68                   [256, 256, 28, 28]        [256, 256, 28, 28]        --                        --
│    │    └─Conv2d: 3-69                 [256, 256, 28, 28]        [256, 256, 14, 14]        589,824                   29,595,009,024
│    │    └─BatchNorm2d: 3-70            [256, 256, 14, 14]        [256, 256, 14, 14]        512                       131,072
│    │    └─ReLU: 3-71                   [256, 256, 14, 14]        [256, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-72                 [256, 256, 14, 14]        [256, 1024, 14, 14]       262,144                   13,153,337,344
│    │    └─BatchNorm2d: 3-73            [256, 1024, 14, 14]       [256, 1024, 14, 14]       2,048                     524,288
│    │    └─Sequential: 3-74             [256, 512, 28, 28]        [256, 1024, 14, 14]       526,336                   26,307,198,976
│    │    └─ReLU: 3-75                   [256, 1024, 14, 14]       [256, 1024, 14, 14]       --                        --
│    └─Bottleneck: 2-9                   [256, 1024, 14, 14]       [256, 1024, 14, 14]       --                        --
│    │    └─Conv2d: 3-76                 [256, 1024, 14, 14]       [256, 256, 14, 14]        262,144                   13,153,337,344
│    │    └─BatchNorm2d: 3-77            [256, 256, 14, 14]        [256, 256, 14, 14]        512                       131,072
│    │    └─ReLU: 3-78                   [256, 256, 14, 14]        [256, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-79                 [256, 256, 14, 14]        [256, 256, 14, 14]        589,824                   29,595,009,024
│    │    └─BatchNorm2d: 3-80            [256, 256, 14, 14]        [256, 256, 14, 14]        512                       131,072
│    │    └─ReLU: 3-81                   [256, 256, 14, 14]        [256, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-82                 [256, 256, 14, 14]        [256, 1024, 14, 14]       262,144                   13,153,337,344
│    │    └─BatchNorm2d: 3-83            [256, 1024, 14, 14]       [256, 1024, 14, 14]       2,048                     524,288
│    │    └─ReLU: 3-84                   [256, 1024, 14, 14]       [256, 1024, 14, 14]       --                        --
│    └─Bottleneck: 2-10                  [256, 1024, 14, 14]       [256, 1024, 14, 14]       --                        --
│    │    └─Conv2d: 3-85                 [256, 1024, 14, 14]       [256, 256, 14, 14]        262,144                   13,153,337,344
│    │    └─BatchNorm2d: 3-86            [256, 256, 14, 14]        [256, 256, 14, 14]        512                       131,072
│    │    └─ReLU: 3-87                   [256, 256, 14, 14]        [256, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-88                 [256, 256, 14, 14]        [256, 256, 14, 14]        589,824                   29,595,009,024
│    │    └─BatchNorm2d: 3-89            [256, 256, 14, 14]        [256, 256, 14, 14]        512                       131,072
│    │    └─ReLU: 3-90                   [256, 256, 14, 14]        [256, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-91                 [256, 256, 14, 14]        [256, 1024, 14, 14]       262,144                   13,153,337,344
│    │    └─BatchNorm2d: 3-92            [256, 1024, 14, 14]       [256, 1024, 14, 14]       2,048                     524,288
│    │    └─ReLU: 3-93                   [256, 1024, 14, 14]       [256, 1024, 14, 14]       --                        --
│    └─Bottleneck: 2-11                  [256, 1024, 14, 14]       [256, 1024, 14, 14]       --                        --
│    │    └─Conv2d: 3-94                 [256, 1024, 14, 14]       [256, 256, 14, 14]        262,144                   13,153,337,344
│    │    └─BatchNorm2d: 3-95            [256, 256, 14, 14]        [256, 256, 14, 14]        512                       131,072
│    │    └─ReLU: 3-96                   [256, 256, 14, 14]        [256, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-97                 [256, 256, 14, 14]        [256, 256, 14, 14]        589,824                   29,595,009,024
│    │    └─BatchNorm2d: 3-98            [256, 256, 14, 14]        [256, 256, 14, 14]        512                       131,072
│    │    └─ReLU: 3-99                   [256, 256, 14, 14]        [256, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-100                [256, 256, 14, 14]        [256, 1024, 14, 14]       262,144                   13,153,337,344
│    │    └─BatchNorm2d: 3-101           [256, 1024, 14, 14]       [256, 1024, 14, 14]       2,048                     524,288
│    │    └─ReLU: 3-102                  [256, 1024, 14, 14]       [256, 1024, 14, 14]       --                        --
│    └─Bottleneck: 2-12                  [256, 1024, 14, 14]       [256, 1024, 14, 14]       --                        --
│    │    └─Conv2d: 3-103                [256, 1024, 14, 14]       [256, 256, 14, 14]        262,144                   13,153,337,344
│    │    └─BatchNorm2d: 3-104           [256, 256, 14, 14]        [256, 256, 14, 14]        512                       131,072
│    │    └─ReLU: 3-105                  [256, 256, 14, 14]        [256, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-106                [256, 256, 14, 14]        [256, 256, 14, 14]        589,824                   29,595,009,024
│    │    └─BatchNorm2d: 3-107           [256, 256, 14, 14]        [256, 256, 14, 14]        512                       131,072
│    │    └─ReLU: 3-108                  [256, 256, 14, 14]        [256, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-109                [256, 256, 14, 14]        [256, 1024, 14, 14]       262,144                   13,153,337,344
│    │    └─BatchNorm2d: 3-110           [256, 1024, 14, 14]       [256, 1024, 14, 14]       2,048                     524,288
│    │    └─ReLU: 3-111                  [256, 1024, 14, 14]       [256, 1024, 14, 14]       --                        --
│    └─Bottleneck: 2-13                  [256, 1024, 14, 14]       [256, 1024, 14, 14]       --                        --
│    │    └─Conv2d: 3-112                [256, 1024, 14, 14]       [256, 256, 14, 14]        262,144                   13,153,337,344
│    │    └─BatchNorm2d: 3-113           [256, 256, 14, 14]        [256, 256, 14, 14]        512                       131,072
│    │    └─ReLU: 3-114                  [256, 256, 14, 14]        [256, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-115                [256, 256, 14, 14]        [256, 256, 14, 14]        589,824                   29,595,009,024
│    │    └─BatchNorm2d: 3-116           [256, 256, 14, 14]        [256, 256, 14, 14]        512                       131,072
│    │    └─ReLU: 3-117                  [256, 256, 14, 14]        [256, 256, 14, 14]        --                        --
│    │    └─Conv2d: 3-118                [256, 256, 14, 14]        [256, 1024, 14, 14]       262,144                   13,153,337,344
│    │    └─BatchNorm2d: 3-119           [256, 1024, 14, 14]       [256, 1024, 14, 14]       2,048                     524,288
│    │    └─ReLU: 3-120                  [256, 1024, 14, 14]       [256, 1024, 14, 14]       --                        --
├─Sequential: 1-8                        [256, 1024, 14, 14]       [256, 2048, 7, 7]         --                        --
│    └─Bottleneck: 2-14                  [256, 1024, 14, 14]       [256, 2048, 7, 7]         --                        --
│    │    └─Conv2d: 3-121                [256, 1024, 14, 14]       [256, 512, 14, 14]        524,288                   26,306,674,688
│    │    └─BatchNorm2d: 3-122           [256, 512, 14, 14]        [256, 512, 14, 14]        1,024                     262,144
│    │    └─ReLU: 3-123                  [256, 512, 14, 14]        [256, 512, 14, 14]        --                        --
│    │    └─Conv2d: 3-124                [256, 512, 14, 14]        [256, 512, 7, 7]          2,359,296                 29,595,009,024
│    │    └─BatchNorm2d: 3-125           [256, 512, 7, 7]          [256, 512, 7, 7]          1,024                     262,144
│    │    └─ReLU: 3-126                  [256, 512, 7, 7]          [256, 512, 7, 7]          --                        --
│    │    └─Conv2d: 3-127                [256, 512, 7, 7]          [256, 2048, 7, 7]         1,048,576                 13,153,337,344
│    │    └─BatchNorm2d: 3-128           [256, 2048, 7, 7]         [256, 2048, 7, 7]         4,096                     1,048,576
│    │    └─Sequential: 3-129            [256, 1024, 14, 14]       [256, 2048, 7, 7]         2,101,248                 26,307,723,264
│    │    └─ReLU: 3-130                  [256, 2048, 7, 7]         [256, 2048, 7, 7]         --                        --
│    └─Bottleneck: 2-15                  [256, 2048, 7, 7]         [256, 2048, 7, 7]         --                        --
│    │    └─Conv2d: 3-131                [256, 2048, 7, 7]         [256, 512, 7, 7]          1,048,576                 13,153,337,344
│    │    └─BatchNorm2d: 3-132           [256, 512, 7, 7]          [256, 512, 7, 7]          1,024                     262,144
│    │    └─ReLU: 3-133                  [256, 512, 7, 7]          [256, 512, 7, 7]          --                        --
│    │    └─Conv2d: 3-134                [256, 512, 7, 7]          [256, 512, 7, 7]          2,359,296                 29,595,009,024
│    │    └─BatchNorm2d: 3-135           [256, 512, 7, 7]          [256, 512, 7, 7]          1,024                     262,144
│    │    └─ReLU: 3-136                  [256, 512, 7, 7]          [256, 512, 7, 7]          --                        --
│    │    └─Conv2d: 3-137                [256, 512, 7, 7]          [256, 2048, 7, 7]         1,048,576                 13,153,337,344
│    │    └─BatchNorm2d: 3-138           [256, 2048, 7, 7]         [256, 2048, 7, 7]         4,096                     1,048,576
│    │    └─ReLU: 3-139                  [256, 2048, 7, 7]         [256, 2048, 7, 7]         --                        --
│    └─Bottleneck: 2-16                  [256, 2048, 7, 7]         [256, 2048, 7, 7]         --                        --
│    │    └─Conv2d: 3-140                [256, 2048, 7, 7]         [256, 512, 7, 7]          1,048,576                 13,153,337,344
│    │    └─BatchNorm2d: 3-141           [256, 512, 7, 7]          [256, 512, 7, 7]          1,024                     262,144
│    │    └─ReLU: 3-142                  [256, 512, 7, 7]          [256, 512, 7, 7]          --                        --
│    │    └─Conv2d: 3-143                [256, 512, 7, 7]          [256, 512, 7, 7]          2,359,296                 29,595,009,024
│    │    └─BatchNorm2d: 3-144           [256, 512, 7, 7]          [256, 512, 7, 7]          1,024                     262,144
│    │    └─ReLU: 3-145                  [256, 512, 7, 7]          [256, 512, 7, 7]          --                        --
│    │    └─Conv2d: 3-146                [256, 512, 7, 7]          [256, 2048, 7, 7]         1,048,576                 13,153,337,344
│    │    └─BatchNorm2d: 3-147           [256, 2048, 7, 7]         [256, 2048, 7, 7]         4,096                     1,048,576
│    │    └─ReLU: 3-148                  [256, 2048, 7, 7]         [256, 2048, 7, 7]         --                        --
├─AdaptiveAvgPool2d: 1-9                 [256, 2048, 7, 7]         [256, 2048, 1, 1]         --                        --
├─Linear: 1-10                           [256, 2048]               [256, 1000]               2,049,000                 524,544,000
============================================================================================================================================
Total params: 25,557,032
Trainable params: 25,557,032
Non-trainable params: 0
Total mult-adds (Units.TERABYTES): 1.05
============================================================================================================================================
Input size (MB): 154.14
Forward/backward pass size (MB): 45524.93
Params size (MB): 102.23
Estimated Total Size (MB): 45781.30
============================================================================================================================================