============================================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Param #                   Mult-Adds
============================================================================================================================================
VGG                                      [256, 3, 224, 224]        [256, 1000]               --                        --
├─Sequential: 1-1                        [256, 3, 224, 224]        [256, 512, 7, 7]          --                        --
│    └─Conv2d: 2-1                       [256, 3, 224, 224]        [256, 64, 224, 224]       1,792                     23,018,340,352
│    └─ReLU: 2-2                         [256, 64, 224, 224]       [256, 64, 224, 224]       --                        --
│    └─Conv2d: 2-3                       [256, 64, 224, 224]       [256, 64, 224, 224]       36,928                    474,342,227,968
│    └─ReLU: 2-4                         [256, 64, 224, 224]       [256, 64, 224, 224]       --                        --
│    └─MaxPool2d: 2-5                    [256, 64, 224, 224]       [256, 64, 112, 112]       --                        --
│    └─Conv2d: 2-6                       [256, 64, 112, 112]       [256, 128, 112, 112]      73,856                    237,171,113,984
│    └─ReLU: 2-7                         [256, 128, 112, 112]      [256, 128, 112, 112]      --                        --
│    └─Conv2d: 2-8                       [256, 128, 112, 112]      [256, 128, 112, 112]      147,584                   473,931,186,176
│    └─ReLU: 2-9                         [256, 128, 112, 112]      [256, 128, 112, 112]      --                        --
│    └─MaxPool2d: 2-10                   [256, 128, 112, 112]      [256, 128, 56, 56]        --                        --
│    └─Conv2d: 2-11                      [256, 128, 56, 56]        [256, 256, 56, 56]        295,168                   236,965,593,088
│    └─ReLU: 2-12                        [256, 256, 56, 56]        [256, 256, 56, 56]        --                        --
│    └─Conv2d: 2-13                      [256, 256, 56, 56]        [256, 256, 56, 56]        590,080                   473,725,665,280
│    └─ReLU: 2-14                        [256, 256, 56, 56]        [256, 256, 56, 56]        --                        --
│    └─Conv2d: 2-15                      [256, 256, 56, 56]        [256, 256, 56, 56]        590,080                   473,725,665,280
│    └─ReLU: 2-16                        [256, 256, 56, 56]        [256, 256, 56, 56]        --                        --
│    └─MaxPool2d: 2-17                   [256, 256, 56, 56]        [256, 256, 28, 28]        --                        --
│    └─Conv2d: 2-18                      [256, 256, 28, 28]        [256, 512, 28, 28]        1,180,160                 236,862,832,640
│    └─ReLU: 2-19                        [256, 512, 28, 28]        [256, 512, 28, 28]        --                        --
│    └─Conv2d: 2-20                      [256, 512, 28, 28]        [256, 512, 28, 28]        2,359,808                 473,622,904,832
│    └─ReLU: 2-21                        [256, 512, 28, 28]        [256, 512, 28, 28]        --                        --
│    └─Conv2d: 2-22                      [256, 512, 28, 28]        [256, 512, 28, 28]        2,359,808                 473,622,904,832
│    └─ReLU: 2-23                        [256, 512, 28, 28]        [256, 512, 28, 28]        --                        --
│    └─MaxPool2d: 2-24                   [256, 512, 28, 28]        [256, 512, 14, 14]        --                        --
│    └─Conv2d: 2-25                      [256, 512, 14, 14]        [256, 512, 14, 14]        2,359,808                 118,405,726,208
│    └─ReLU: 2-26                        [256, 512, 14, 14]        [256, 512, 14, 14]        --                        --
│    └─Conv2d: 2-27                      [256, 512, 14, 14]        [256, 512, 14, 14]        2,359,808                 118,405,726,208
│    └─ReLU: 2-28                        [256, 512, 14, 14]        [256, 512, 14, 14]        --                        --
│    └─Conv2d: 2-29                      [256, 512, 14, 14]        [256, 512, 14, 14]        2,359,808                 118,405,726,208
│    └─ReLU: 2-30                        [256, 512, 14, 14]        [256, 512, 14, 14]        --                        --
│    └─MaxPool2d: 2-31                   [256, 512, 14, 14]        [256, 512, 7, 7]          --                        --
├─AdaptiveAvgPool2d: 1-2                 [256, 512, 7, 7]          [256, 512, 7, 7]          --                        --
├─Sequential: 1-3                        [256, 25088]              [256, 1000]               --                        --
│    └─Linear: 2-32                      [256, 25088]              [256, 4096]               102,764,544               26,307,723,264
│    └─ReLU: 2-33                        [256, 4096]               [256, 4096]               --                        --
│    └─Dropout: 2-34                     [256, 4096]               [256, 4096]               --                        --
│    └─Linear: 2-35                      [256, 4096]               [256, 4096]               16,781,312                4,296,015,872
│    └─ReLU: 2-36                        [256, 4096]               [256, 4096]               --                        --
│    └─Dropout: 2-37                     [256, 4096]               [256, 4096]               --                        --
│    └─Linear: 2-38                      [256, 4096]               [256, 1000]               4,097,000                 1,048,832,000
============================================================================================================================================
Total params: 138,357,544
Trainable params: 138,357,544
Non-trainable params: 0
Total mult-adds (Units.TERABYTES): 3.96
============================================================================================================================================
Input size (MB): 154.14
Forward/backward pass size (MB): 27764.15
Params size (MB): 553.43
Estimated Total Size (MB): 28471.72
============================================================================================================================================